[Killed] ConditionalExpression
src/uri.js:24:22
 let SVC_CTX_PREFIX = '';
 let UI_CTX_PREFIX = '';
 // eslint-disable-next-line no-undef
-const DEFAULT_THAT = typeof window != 'undefined' ? window.document.URL : /* istanbul ignore next */ '';
+const DEFAULT_THAT = false ? window.document.URL : /* istanbul ignore next */ '';
 
 // function fromWindow(){} NOT PORTED
killedBy: mixin test: [null, {"query": "a=b"}, "http://localhost/foo/?a=b"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/?a=b"
Received: "?a=b"

[Killed] EqualityOperator
src/uri.js:24:22
 let SVC_CTX_PREFIX = '';
 let UI_CTX_PREFIX = '';
 // eslint-disable-next-line no-undef
-const DEFAULT_THAT = typeof window != 'undefined' ? window.document.URL : /* istanbul ignore next */ '';
+const DEFAULT_THAT = typeof window == 'undefined' ? window.document.URL : /* istanbul ignore next */ '';
 
 // function fromWindow(){} NOT PORTED
killedBy: mixin test: [null, {"query": "a=b"}, "http://localhost/foo/?a=b"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/?a=b"
Received: "?a=b"

[Killed] BlockStatement
src/uri.js:29:23
 // function fromWindow(){} NOT PORTED
 // function navigate(){} NOT PORTED
 
-function config(conf) {
-    // NTH: assert not null, or fallback from CTX to others..
-    ({ CTX, UI_CTX_PREFIX, SVC_CTX_PREFIX } = conf);
-}
+function config(conf) {}
 
 // paramString window.document.URL instead use '' (or try use '/', or...)
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/ui/c/d/"
Received: "/a/ui/c/d/"

[Killed] BlockStatement
src/uri.js:35:41
 }
 
 // paramString window.document.URL instead use '' (or try use '/', or...)
-function equalsQueryStr(query1, query2) {
-    function simpleCompare(a, b) {
-        return (a < b ? -1 : (a > b ? 1 : 0));
-    }
-
-    function customizer(a, b) {
-        if (a instanceof Array && b instanceof Array) {
-            // order is not important, so just sort them before comparing
-            a.sort(simpleCompare);
-            b.sort(simpleCompare);
-        }
-        return undefined; // isEqualWith will do the job if we return undef
-    }
-
-    if (!query1 || !query2) {
-        return query1 === query2;
-    }
-    const q1 = uri.parseQuery(query1);
-    const q2 = uri.parseQuery(query2);
-
-    return isEqualWith(q1, q2, customizer);
-}
+function equalsQueryStr(query1, query2) {}
 
 function clone(uriArr) {
killedBy: equalsQueryStrData test: ['type=animal&name=narwhal', 'name=narwhal&type=animal', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/uri.js:36:34
 
 // paramString window.document.URL instead use '' (or try use '/', or...)
 function equalsQueryStr(query1, query2) {
-    function simpleCompare(a, b) {
-        return (a < b ? -1 : (a > b ? 1 : 0));
-    }
+    function simpleCompare(a, b) {}
 
     function customizer(a, b) {
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UnaryOperator
src/uri.js:37:25
 // paramString window.document.URL instead use '' (or try use '/', or...)
 function equalsQueryStr(query1, query2) {
     function simpleCompare(a, b) {
-        return (a < b ? -1 : (a > b ? 1 : 0));
+        return (a < b ? +1 : (a > b ? 1 : 0));
     }
 
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/uri.js:37:17
 // paramString window.document.URL instead use '' (or try use '/', or...)
 function equalsQueryStr(query1, query2) {
     function simpleCompare(a, b) {
-        return (a < b ? -1 : (a > b ? 1 : 0));
+        return (true ? -1 : (a > b ? 1 : 0));
     }
 
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/uri.js:40:31
         return (a < b ? -1 : (a > b ? 1 : 0));
     }
 
-    function customizer(a, b) {
-        if (a instanceof Array && b instanceof Array) {
-            // order is not important, so just sort them before comparing
-            a.sort(simpleCompare);
-            b.sort(simpleCompare);
-        }
-        return undefined; // isEqualWith will do the job if we return undef
-    }
+    function customizer(a, b) {}
 
     if (!query1 || !query2) {
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/uri.js:41:13
     }
 
     function customizer(a, b) {
-        if (a instanceof Array && b instanceof Array) {
+        if (false) {
             // order is not important, so just sort them before comparing
             a.sort(simpleCompare);
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/uri.js:41:55
     }
 
     function customizer(a, b) {
-        if (a instanceof Array && b instanceof Array) {
-            // order is not important, so just sort them before comparing
-            a.sort(simpleCompare);
-            b.sort(simpleCompare);
-        }
+        if (a instanceof Array && b instanceof Array) {}
         return undefined; // isEqualWith will do the job if we return undef
     }
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/uri.js:43:13
     function customizer(a, b) {
         if (a instanceof Array && b instanceof Array) {
             // order is not important, so just sort them before comparing
-            a.sort(simpleCompare);
+            a;
             b.sort(simpleCompare);
         }
killedBy: equalsQueryStrData test: ['name=foo&name=bar', 'name=bar&name=foo', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/uri.js:44:13
         if (a instanceof Array && b instanceof Array) {
             // order is not important, so just sort them before comparing
             a.sort(simpleCompare);
-            b.sort(simpleCompare);
+            b;
         }
         return undefined; // isEqualWith will do the job if we return undef

[Killed] ConditionalExpression
src/uri.js:49:9
         return undefined; // isEqualWith will do the job if we return undef
     }
 
-    if (!query1 || !query2) {
+    if (true) {
         return query1 === query2;
     }
killedBy: equalsQueryStrData test: ['type=animal&name=narwhal', 'name=narwhal&type=animal', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/uri.js:49:9
         return undefined; // isEqualWith will do the job if we return undef
     }
 
-    if (!query1 || !query2) {
+    if (query1 || !query2) {
         return query1 === query2;
     }
killedBy: equalsQueryStrData test: ['type=animal&name=narwhal', 'name=narwhal&type=animal', true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/uri.js:50:16
     }
 
     if (!query1 || !query2) {
-        return query1 === query2;
+        return query1 !== query2;
     }
     const q1 = uri.parseQuery(query1);
killedBy: equalsQueryStrData test: ['', 'b=2&a=1&a=3', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/uri.js:50:16
     }
 
     if (!query1 || !query2) {
-        return query1 === query2;
+        return true;
     }
     const q1 = uri.parseQuery(query1);
killedBy: equalsQueryStrData test: ['', 'b=2&a=1&a=3', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/uri.js:58:24
     return isEqualWith(q1, q2, customizer);
 }
 
-function clone(uriArr) {
-    return Object.assign({}, uriArr);
-}
+function clone(uriArr) {}
 
 function param(that) {
killedBy: mixin test: [{"authority": "www.google.sk", "host": "www.google.sk", "path": "", "scheme": "http"}, {"host": "www.afoj.sk"}, "http://www.afoj.sk"]
statusReason: TypeError: Cannot set properties of undefined (setting 'host')

[Killed] BlockStatement
src/uri.js:62:22
     return Object.assign({}, uriArr);
 }
 
-function param(that) {
-    that != null || (that = DEFAULT_THAT); // let '' continue
-    return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
-}
+function param(that) {}
 function _resolve(base, ref) {
     // less strict version of uri.resolve, scheme is not required
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: TypeError: Cannot read properties of undefined (reading 'scheme')

[Killed] ConditionalExpression
src/uri.js:63:5
 }
 
 function param(that) {
-    that != null || (that = DEFAULT_THAT); // let '' continue
+    true; // let '' continue
     return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
 }
killedBy: mixin test: [null, {"query": "a=b"}, "http://localhost/foo/?a=b"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/?a=b"
Received: "undefined?a=b"

[Killed] ConditionalExpression
src/uri.js:63:5
 }
 
 function param(that) {
-    that != null || (that = DEFAULT_THAT); // let '' continue
+    false; // let '' continue
     return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
 }
killedBy: mixin test: [null, {"query": "a=b"}, "http://localhost/foo/?a=b"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/?a=b"
Received: "undefined?a=b"

[Killed] ConditionalExpression
src/uri.js:64:13
 
 function param(that) {
     that != null || (that = DEFAULT_THAT); // let '' continue
-    return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
+    return (true) ? uri.decomposeComponents(that) : clone(that);
 }
 function _resolve(base, ref) {
killedBy: mixin test: [{"authority": "www.google.sk", "host": "www.google.sk", "path": "", "scheme": "http"}, {"host": "www.afoj.sk"}, "http://www.afoj.sk"]
statusReason: TypeError: uriStr.match is not a function or its return value is not iterable

[Killed] EqualityOperator
src/uri.js:64:13
 
 function param(that) {
     that != null || (that = DEFAULT_THAT); // let '' continue
-    return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
+    return (typeof that != 'string') ? uri.decomposeComponents(that) : clone(that);
 }
 function _resolve(base, ref) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: TypeError: Cannot read properties of undefined (reading 'charAt')

[Killed] BlockStatement
src/uri.js:66:30
     that != null || (that = DEFAULT_THAT); // let '' continue
     return (typeof that == 'string') ? uri.decomposeComponents(that) : clone(that);
 }
-function _resolve(base, ref) {
-    // less strict version of uri.resolve, scheme is not required
-    const scheme = base.scheme;
-    if (!scheme) {
-        base.scheme = 'http';
-    }
-    const s = uri.resolve(base, ref);
-    if (!scheme) {
-        delete s.scheme;
-    }
-    return s;
-}
+function _resolve(base, ref) {}
 
 /**
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: TypeError: Cannot destructure property 'scheme' of 'undefined' as it is undefined.

[Killed] ConditionalExpression
src/uri.js:69:9
 function _resolve(base, ref) {
     // less strict version of uri.resolve, scheme is not required
     const scheme = base.scheme;
-    if (!scheme) {
+    if (true) {
         base.scheme = 'http';
     }
killedBy: resolveAsSubordinate test: ["foo://username:password@my.example.com:8042/a/b?type=animal&name=narwhal#nose", "/a/b/c/d"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/a/b/c/d"
Received: "http://username:password@my.example.com:8042/a/b/c/d"

[Killed] BooleanLiteral
src/uri.js:69:9
 function _resolve(base, ref) {
     // less strict version of uri.resolve, scheme is not required
     const scheme = base.scheme;
-    if (!scheme) {
+    if (scheme) {
         base.scheme = 'http';
     }
killedBy: resolve test: ['./../^g*', '', '^g*']
statusReason: Error: Violation 5.2.1, scheme component required

[Killed] ConditionalExpression
src/uri.js:73:9
         base.scheme = 'http';
     }
     const s = uri.resolve(base, ref);
-    if (!scheme) {
+    if (true) {
         delete s.scheme;
     }
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "h"

[Killed] BlockStatement
src/uri.js:73:18
         base.scheme = 'http';
     }
     const s = uri.resolve(base, ref);
-    if (!scheme) {
-        delete s.scheme;
-    }
+    if (!scheme) {}
     return s;
 }
killedBy: resolve test: ['./../^g*', '', '^g*']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "^g*"
Received: "http:^g*"

[Killed] BlockStatement
src/uri.js:86:90
 * @memberof module:Uri
 * @returns {string} Modified copy of `that`.
 */
-function mixin(that, { authority, userInfo, host, port, scheme, path, query, fragment }) {
-    const u = param(that);
-
-    /* 'app/_base/rql' */
-    if (authority !== undefined) {
-        u.authority = authority;
-        if (u.authority) {
-            ({ userInfo, host, port } = uri.decomposeComponents(`//${u.authority}`));
-            Object.assign(u, { userInfo, host, port });
-        } else {
-            u.userInfo = u.host = u.port = undefined;
-        }
-    } else {
-        userInfo && (u.userInfo = userInfo);
-        host && (u.host = host);
-        port && (u.port = port);
-        u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
-    }
-    scheme && (u.scheme = scheme);
-    path && (u.path = path);
-    query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
-    fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
-    return uri.recomposeComponents(u);
-}
+function mixin(that, { authority, userInfo, host, port, scheme, path, query, fragment }) {}
 
 function isSubPath(baseStr, refStr) {
killedBy: mixin test: ["/g?j=l", {"path": "/o"}, "/o?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/o?j=l"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:90:9
     const u = param(that);
 
     /* 'app/_base/rql' */
-    if (authority !== undefined) {
+    if (false) {
         u.authority = authority;
         if (u.authority) {
killedBy: mixin test: ["/g?j=l", {"authority": "john.doe@www.example.com"}, "//john.doe@www.example.com/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//john.doe@www.example.com/g?j=l"
Received: "/g?j=l"

[Killed] EqualityOperator
src/uri.js:90:9
     const u = param(that);
 
     /* 'app/_base/rql' */
-    if (authority !== undefined) {
+    if (authority === undefined) {
         u.authority = authority;
         if (u.authority) {
killedBy: mixin test: ["/g?j=l", {"authority": "john.doe@www.example.com"}, "//john.doe@www.example.com/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//john.doe@www.example.com/g?j=l"
Received: "/g?j=l"

[Killed] BlockStatement
src/uri.js:92:26
     /* 'app/_base/rql' */
     if (authority !== undefined) {
         u.authority = authority;
-        if (u.authority) {
-            ({ userInfo, host, port } = uri.decomposeComponents(`//${u.authority}`));
-            Object.assign(u, { userInfo, host, port });
-        } else {
+        if (u.authority) {} else {
             u.userInfo = u.host = u.port = undefined;
         }
killedBy: mixin test: ["/g?j=l", {"authority": "john.doe@www.example.com"}, "//john.doe@www.example.com/g?j=l"]
statusReason: Error: Illegal host:undefined

[Killed] ConditionalExpression
src/uri.js:92:13
     /* 'app/_base/rql' */
     if (authority !== undefined) {
         u.authority = authority;
-        if (u.authority) {
+        if (false) {
             ({ userInfo, host, port } = uri.decomposeComponents(`//${u.authority}`));
             Object.assign(u, { userInfo, host, port });
killedBy: mixin test: ["/g?j=l", {"authority": "john.doe@www.example.com"}, "//john.doe@www.example.com/g?j=l"]
statusReason: Error: Illegal host:undefined

[Killed] BlockStatement
src/uri.js:95:16
         if (u.authority) {
             ({ userInfo, host, port } = uri.decomposeComponents(`//${u.authority}`));
             Object.assign(u, { userInfo, host, port });
-        } else {
-            u.userInfo = u.host = u.port = undefined;
-        }
+        } else {}
     } else {
         userInfo && (u.userInfo = userInfo);
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"authority": null}, "/g?j=l"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] BlockStatement
src/uri.js:98:12
         } else {
             u.userInfo = u.host = u.port = undefined;
         }
-    } else {
-        userInfo && (u.userInfo = userInfo);
-        host && (u.host = host);
-        port && (u.port = port);
-        u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
-    }
+    } else {}
     scheme && (u.scheme = scheme);
     path && (u.path = path);
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"host": "seznam.cz"}, "//jozo@seznam.cz:8080/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//jozo@seznam.cz:8080/g?j=l"
Received: "//jozo@www.google.sk:8080/g?j=l"

[Killed] LogicalOperator
src/uri.js:99:9
             u.userInfo = u.host = u.port = undefined;
         }
     } else {
-        userInfo && (u.userInfo = userInfo);
+        userInfo || (u.userInfo = userInfo);
         host && (u.host = host);
         port && (u.port = port);
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"host": "seznam.cz"}, "//jozo@seznam.cz:8080/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//jozo@seznam.cz:8080/g?j=l"
Received: "//seznam.cz:8080/g?j=l"

[Killed] ConditionalExpression
src/uri.js:99:9
             u.userInfo = u.host = u.port = undefined;
         }
     } else {
-        userInfo && (u.userInfo = userInfo);
+        false;
         host && (u.host = host);
         port && (u.port = port);
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"fragment": [Object], "host": "afoj.sk", "path": "/t", "port": "78", "query": [Object], "scheme": "https", "userInfo": "j"}, "https://j@afoj.sk:78/t?w=5#s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=5#s=7"
Received: "https://jozo@afoj.sk:78/t?w=5#s=7"

[Killed] ConditionalExpression
src/uri.js:100:9
         }
     } else {
         userInfo && (u.userInfo = userInfo);
-        host && (u.host = host);
+        false;
         port && (u.port = port);
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"host": "seznam.cz"}, "//jozo@seznam.cz:8080/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//jozo@seznam.cz:8080/g?j=l"
Received: "//jozo@www.google.sk:8080/g?j=l"

[Killed] ConditionalExpression
src/uri.js:100:9
         }
     } else {
         userInfo && (u.userInfo = userInfo);
-        host && (u.host = host);
+        true;
         port && (u.port = port);
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"host": "seznam.cz"}, "//jozo@seznam.cz:8080/g?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//jozo@seznam.cz:8080/g?j=l"
Received: "//jozo@www.google.sk:8080/g?j=l"

[Killed] ConditionalExpression
src/uri.js:101:9
     } else {
         userInfo && (u.userInfo = userInfo);
         host && (u.host = host);
-        port && (u.port = port);
+        false;
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"fragment": [Object], "host": "afoj.sk", "path": "/t", "port": "78", "query": [Object], "scheme": "https", "userInfo": "j"}, "https://j@afoj.sk:78/t?w=5#s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=5#s=7"
Received: "https://j@afoj.sk:80/t?w=5#s=7"

[Killed] ConditionalExpression
src/uri.js:101:9
     } else {
         userInfo && (u.userInfo = userInfo);
         host && (u.host = host);
-        port && (u.port = port);
+        true;
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"fragment": [Object], "host": "afoj.sk", "path": "/t", "port": "78", "query": [Object], "scheme": "https", "userInfo": "j"}, "https://j@afoj.sk:78/t?w=5#s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=5#s=7"
Received: "https://j@afoj.sk:80/t?w=5#s=7"

[Killed] LogicalOperator
src/uri.js:102:9
         userInfo && (u.userInfo = userInfo);
         host && (u.host = host);
         port && (u.port = port);
-        u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
+        u.host || (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
     scheme && (u.scheme = scheme);
killedBy: mixin test: ["/g?j=l", {"path": "/o"}, "/o?j=l"]
statusReason: Error: Illegal host:undefined

[Killed] ConditionalExpression
src/uri.js:102:9
         userInfo && (u.userInfo = userInfo);
         host && (u.host = host);
         port && (u.port = port);
-        u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
+        true;
     }
     scheme && (u.scheme = scheme);
killedBy: mixin test: ["//jozo@www.google.sk:8080/g?j=l", {"host": "seznam.cz"}, "//jozo@seznam.cz:8080/g?j=l"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/uri.js:104:5
         port && (u.port = port);
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
-    scheme && (u.scheme = scheme);
+    false;
     path && (u.path = path);
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"authority": "j@afoj.sk:78", "fragment": "7", "path": "/t", "query": "w=f", "scheme": "https"}, "https://j@afoj.sk:78/t?w=f#7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=f#7"
Received: "http://j@afoj.sk:78/t?w=f#7"

[Killed] LogicalOperator
src/uri.js:104:5
         port && (u.port = port);
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
-    scheme && (u.scheme = scheme);
+    scheme || (u.scheme = scheme);
     path && (u.path = path);
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"authority": "j@afoj.sk:78", "fragment": "7", "path": "/t", "query": "w=f", "scheme": "https"}, "https://j@afoj.sk:78/t?w=f#7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=f#7"
Received: "http://j@afoj.sk:78/t?w=f#7"

[Killed] LogicalOperator
src/uri.js:105:5
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
     scheme && (u.scheme = scheme);
-    path && (u.path = path);
+    path || (u.path = path);
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
     fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
killedBy: mixin test: ["/g?j=l", {"path": "/o"}, "/o?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/o?j=l"
Received: "/g?j=l"

[Killed] ConditionalExpression
src/uri.js:105:5
         u.host && (u.authority = uri.recomposeAuthorityComponents(u.userInfo, u.host, u.port));
     }
     scheme && (u.scheme = scheme);
-    path && (u.path = path);
+    true;
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
     fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
killedBy: mixin test: ["/g?j=l", {"path": "/o"}, "/o?j=l"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/o?j=l"
Received: "/g?j=l"

[Killed] ConditionalExpression
src/uri.js:106:5
     }
     scheme && (u.scheme = scheme);
     path && (u.path = path);
-    query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
+    false;
     fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
     return uri.recomposeComponents(u);
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"authority": "j@afoj.sk:78", "fragment": "7", "path": "/t", "query": "w=f", "scheme": "https"}, "https://j@afoj.sk:78/t?w=f#7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=f#7"
Received: "https://j@afoj.sk:78/t?j=l#7"

[Killed] ConditionalExpression
src/uri.js:106:34
     }
     scheme && (u.scheme = scheme);
     path && (u.path = path);
-    query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
+    query && (u.query = query && true ? querystring.stringify(query) : query);
     fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
     return uri.recomposeComponents(u);
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"authority": "j@afoj.sk:78", "fragment": "7", "path": "/t", "query": "w=f", "scheme": "https"}, "https://j@afoj.sk:78/t?w=f#7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=f#7"
Received: "https://j@afoj.sk:78/t?#7"

[Killed] ConditionalExpression
src/uri.js:107:43
     scheme && (u.scheme = scheme);
     path && (u.path = path);
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
-    fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
+    fragment && (u.fragment = fragment && true ? querystring.stringify(fragment) : fragment);
     return uri.recomposeComponents(u);
 }
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"authority": "j@afoj.sk:78", "fragment": "7", "path": "/t", "query": "w=f", "scheme": "https"}, "https://j@afoj.sk:78/t?w=f#7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=f#7"
Received: "https://j@afoj.sk:78/t?w=f#"

[Killed] ConditionalExpression
src/uri.js:107:31
     scheme && (u.scheme = scheme);
     path && (u.path = path);
     query && (u.query = query && typeof query != 'string' ? querystring.stringify(query) : query);
-    fragment && (u.fragment = fragment && typeof fragment != 'string' ? querystring.stringify(fragment) : fragment);
+    fragment && (u.fragment = false ? querystring.stringify(fragment) : fragment);
     return uri.recomposeComponents(u);
 }
killedBy: mixin test: ["http://jozo@k.sk:80/g?j=l#ah", {"fragment": [Object], "host": "afoj.sk", "path": "/t", "port": "78", "query": [Object], "scheme": "https", "userInfo": "j"}, "https://j@afoj.sk:78/t?w=5#s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://j@afoj.sk:78/t?w=5#s=7"
Received: "https://j@afoj.sk:78/t?w=5#[object Object]"

[Killed] BlockStatement
src/uri.js:111:37
     return uri.recomposeComponents(u);
 }
 
-function isSubPath(baseStr, refStr) {
-    const bs = uri.decodeSegments(baseStr);
-    const rs = uri.decodeSegments(refStr);
-    if (bs.length > rs.length) {
-        return false;
-    }
-    if (bs[bs.length - 1] === '') { // dont compare with void segment
-        bs.pop();
-    }
-    return bs.reverse().every((item, i) => item === rs[bs.length - 1 - i]);
-}
+function isSubPath(baseStr, refStr) {}
 
 function paramString(that) {
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: IllegalArgument, context not present
