[Killed] EqualityOperator
src/uri.js:114:9
 function isSubPath(baseStr, refStr) {
     const bs = uri.decodeSegments(baseStr);
     const rs = uri.decodeSegments(refStr);
-    if (bs.length > rs.length) {
+    if (bs.length <= rs.length) {
         return false;
     }
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: IllegalArgument, context not present

[Killed] EqualityOperator
src/uri.js:114:9
 function isSubPath(baseStr, refStr) {
     const bs = uri.decodeSegments(baseStr);
     const rs = uri.decodeSegments(refStr);
-    if (bs.length > rs.length) {
+    if (bs.length >= rs.length) {
         return false;
     }
killedBy: strip empty context test empty ctx
statusReason: Error: IllegalArgument, context not present

[Killed] BooleanLiteral
src/uri.js:115:16
     const bs = uri.decodeSegments(baseStr);
     const rs = uri.decodeSegments(refStr);
     if (bs.length > rs.length) {
-        return false;
+        return true;
     }
     if (bs[bs.length - 1] === '') { // dont compare with void segment
killedBy: strip should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/uri.js:117:9
     if (bs.length > rs.length) {
         return false;
     }
-    if (bs[bs.length - 1] === '') { // dont compare with void segment
+    if (true) { // dont compare with void segment
         bs.pop();
     }
killedBy: strip test: ["/a/svc/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "c/c/d/"

[Killed] EqualityOperator
src/uri.js:117:9
     if (bs.length > rs.length) {
         return false;
     }
-    if (bs[bs.length - 1] === '') { // dont compare with void segment
+    if (bs[bs.length - 1] !== '') { // dont compare with void segment
         bs.pop();
     }
killedBy: strip test: ["/a/svc/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "c/c/d/"

[Killed] ArithmeticOperator
src/uri.js:120:56
     if (bs[bs.length - 1] === '') { // dont compare with void segment
         bs.pop();
     }
-    return bs.reverse().every((item, i) => item === rs[bs.length - 1 - i]);
+    return bs.reverse().every((item, i) => item === rs[bs.length - 1 + i]);
 }
 
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: IllegalArgument, context prefix not present

[Killed] MethodExpression
src/uri.js:120:12
     if (bs[bs.length - 1] === '') { // dont compare with void segment
         bs.pop();
     }
-    return bs.reverse().every((item, i) => item === rs[bs.length - 1 - i]);
+    return bs.every((item, i) => item === rs[bs.length - 1 - i]);
 }
 
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: IllegalArgument, context prefix not present

[Killed] BlockStatement
src/uri.js:123:28
     return bs.reverse().every((item, i) => item === rs[bs.length - 1 - i]);
 }
 
-function paramString(that) {
-    that != null || (that = DEFAULT_THAT);
-    return (typeof that === 'string') ? that : uri.recomposeComponents(that);
-}
+function paramString(that) {}
 
 function contains(arr, what) {
killedBy: toString test: [null, "http://localhost/foo/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:124:5
 }
 
 function paramString(that) {
-    that != null || (that = DEFAULT_THAT);
+    true;
     return (typeof that === 'string') ? that : uri.recomposeComponents(that);
 }
killedBy: toString test: [null, "http://localhost/foo/"]
statusReason: TypeError: Cannot destructure property 'scheme' of 'object null' as it is null.

[Killed] LogicalOperator
src/uri.js:124:5
 }
 
 function paramString(that) {
-    that != null || (that = DEFAULT_THAT);
+    that != null && (that = DEFAULT_THAT);
     return (typeof that === 'string') ? that : uri.recomposeComponents(that);
 }
killedBy: toString test: [null, "http://localhost/foo/"]
statusReason: TypeError: Cannot destructure property 'scheme' of 'object null' as it is null.

[Killed] ConditionalExpression
src/uri.js:125:13
 
 function paramString(that) {
     that != null || (that = DEFAULT_THAT);
-    return (typeof that === 'string') ? that : uri.recomposeComponents(that);
+    return (false) ? that : uri.recomposeComponents(that);
 }
 
killedBy: toString test: [null, "http://localhost/foo/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/"
Received: "undefined"

[Killed] ConditionalExpression
src/uri.js:125:13
 
 function paramString(that) {
     that != null || (that = DEFAULT_THAT);
-    return (typeof that === 'string') ? that : uri.recomposeComponents(that);
+    return (true) ? that : uri.recomposeComponents(that);
 }
 
killedBy: toString test: [{"authority": "www.google.sk", "host": "www.google.sk", "path": "", "scheme": "http"}, "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: {"authority": "www.google.sk", "host": "www.google.sk", "path": "", "scheme": "http"}

[Killed] BlockStatement
src/uri.js:128:30
     return (typeof that === 'string') ? that : uri.recomposeComponents(that);
 }
 
-function contains(arr, what) {
-    return arr.indexOf(what) !== -1;
-}
+function contains(arr, what) {}
 
 /**
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: "http://www.google.sk/foo"

[Killed] UnaryOperator
src/uri.js:129:34
 }
 
 function contains(arr, what) {
-    return arr.indexOf(what) !== -1;
+    return arr.indexOf(what) !== +1;
 }
 
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: IllegalArgument, context not present

[Killed] ConditionalExpression
src/uri.js:129:12
 }
 
 function contains(arr, what) {
-    return arr.indexOf(what) !== -1;
+    return false;
 }
 
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: "http://www.google.sk/foo"

[Killed] BlockStatement
src/uri.js:138:25
  * @memberof module:Uri
  * @returns {string} URI string.
  */
-function toString(that) {
-    return paramString(that);
-}
+function toString(that) {}
 
 /**
killedBy: toString test: [null, "http://localhost/foo/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost/foo/"
Received: undefined

[Killed] BlockStatement
src/uri.js:148:22
  * @memberof module:Uri
  * @returns {UriObj} URI object with properties: `scheme`, `authority`, `userInfo`, `host`, `port`, `path`, `query`, `fragment`.
  */
-function toUri(that) {
-    return param(that);
-}
+function toUri(that) {}
 
 /**
killedBy: toUri test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"authority": "www.google.sk", "host": "www.google.sk", "path": "", "scheme": "http"}
Received: undefined

[Killed] ConditionalExpression
src/uri.js:165:9
 
     toStrip = toStrip.split(',');
 
-    if (contains(toStrip, 'ORIGIN')) {
+    if (true) {
         // clear them all to keep object consistent for auth invariant
         scheme = authority = host = port = userInfo = undefined; // orig uses undefined not nulls
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: ""

[Killed] BlockStatement
src/uri.js:165:38
 
     toStrip = toStrip.split(',');
 
-    if (contains(toStrip, 'ORIGIN')) {
-        // clear them all to keep object consistent for auth invariant
-        scheme = authority = host = port = userInfo = undefined; // orig uses undefined not nulls
-    }
+    if (contains(toStrip, 'ORIGIN')) {}
     if (contains(toStrip, 'PATH')) {
         path = ''; // dont use undefined, resulting path should be empty ('/')
killedBy: strip test: ["http://www.google.sk/foo/bar?w=f#p=7", "ORIGIN", "/foo/bar?w=f#p=7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/bar?w=f#p=7"
Received: "http://www.google.sk/foo/bar?w=f#p=7"

[Killed] ConditionalExpression
src/uri.js:169:9
         // clear them all to keep object consistent for auth invariant
         scheme = authority = host = port = userInfo = undefined; // orig uses undefined not nulls
     }
-    if (contains(toStrip, 'PATH')) {
+    if (false) {
         path = ''; // dont use undefined, resulting path should be empty ('/')
     } else {
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: "http://www.google.sk/foo"

[Killed] BlockStatement
src/uri.js:169:36
         // clear them all to keep object consistent for auth invariant
         scheme = authority = host = port = userInfo = undefined; // orig uses undefined not nulls
     }
-    if (contains(toStrip, 'PATH')) {
-        path = ''; // dont use undefined, resulting path should be empty ('/')
-    } else {
+    if (contains(toStrip, 'PATH')) {} else {
         if (contains(toStrip, 'CTX')) {
             if (!isSubPath(CTX, path)) {
killedBy: strip test: ["http://www.google.sk/foo", "QUERY,PATH,FRAGMENT", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: "http://www.google.sk/foo"

[Killed] BlockStatement
src/uri.js:172:39
     if (contains(toStrip, 'PATH')) {
         path = ''; // dont use undefined, resulting path should be empty ('/')
     } else {
-        if (contains(toStrip, 'CTX')) {
-            if (!isSubPath(CTX, path)) {
-                throw new Error('IllegalArgument, context not present');
-            }
-            path = path.substring(CTX.length);
-        } else if (contains(toStrip, 'CTX_PREFIX')) {
+        if (contains(toStrip, 'CTX')) {} else if (contains(toStrip, 'CTX_PREFIX')) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
                 path = path.substring(UI_CTX_PREFIX.length);
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/ui/c/d/"
Received: "/a/ui/c/d/"

[Killed] ConditionalExpression
src/uri.js:172:13
     if (contains(toStrip, 'PATH')) {
         path = ''; // dont use undefined, resulting path should be empty ('/')
     } else {
-        if (contains(toStrip, 'CTX')) {
+        if (true) {
             if (!isSubPath(CTX, path)) {
                 throw new Error('IllegalArgument, context not present');
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: IllegalArgument, context not present

[Killed] ConditionalExpression
src/uri.js:173:17
         path = ''; // dont use undefined, resulting path should be empty ('/')
     } else {
         if (contains(toStrip, 'CTX')) {
-            if (!isSubPath(CTX, path)) {
+            if (false) {
                 throw new Error('IllegalArgument, context not present');
             }
killedBy: stripCtx should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, context not present"

Received function did not throw

[Killed] BooleanLiteral
src/uri.js:173:17
         path = ''; // dont use undefined, resulting path should be empty ('/')
     } else {
         if (contains(toStrip, 'CTX')) {
-            if (!isSubPath(CTX, path)) {
+            if (isSubPath(CTX, path)) {
                 throw new Error('IllegalArgument, context not present');
             }
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: IllegalArgument, context not present

[Killed] MethodExpression
src/uri.js:176:20
             if (!isSubPath(CTX, path)) {
                 throw new Error('IllegalArgument, context not present');
             }
-            path = path.substring(CTX.length);
+            path = path;
         } else if (contains(toStrip, 'CTX_PREFIX')) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
killedBy: strip test: ["/a/ui/c/d/", "CTX", "/ui/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/ui/c/d/"
Received: "/a/ui/c/d/"

[Killed] ConditionalExpression
src/uri.js:177:20
                 throw new Error('IllegalArgument, context not present');
             }
             path = path.substring(CTX.length);
-        } else if (contains(toStrip, 'CTX_PREFIX')) {
+        } else if (false) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
                 path = path.substring(UI_CTX_PREFIX.length);
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "/a/ui/c/d/"

[Killed] BlockStatement
src/uri.js:177:53
                 throw new Error('IllegalArgument, context not present');
             }
             path = path.substring(CTX.length);
-        } else if (contains(toStrip, 'CTX_PREFIX')) {
-            if (isSubPath(UI_CTX_PREFIX, path)) {
-                path = path.substring(UI_CTX_PREFIX.length);
-            } else if (isSubPath(SVC_CTX_PREFIX, path)) {
-                path = path.substring(SVC_CTX_PREFIX.length);
-            } else {
-                throw new Error('IllegalArgument, context prefix not present');
-            }
-        }
+        } else if (contains(toStrip, 'CTX_PREFIX')) {}
         if (contains(toStrip, 'EXTENSION')) {
             const segments = uri.decodeSegments(path);
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "/a/ui/c/d/"

[Killed] ConditionalExpression
src/uri.js:178:17
             }
             path = path.substring(CTX.length);
         } else if (contains(toStrip, 'CTX_PREFIX')) {
-            if (isSubPath(UI_CTX_PREFIX, path)) {
+            if (true) {
                 path = path.substring(UI_CTX_PREFIX.length);
             } else if (isSubPath(SVC_CTX_PREFIX, path)) {
killedBy: strip test: ["/a/svc/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "c/c/d/"

[Killed] ConditionalExpression
src/uri.js:178:17
             }
             path = path.substring(CTX.length);
         } else if (contains(toStrip, 'CTX_PREFIX')) {
-            if (isSubPath(UI_CTX_PREFIX, path)) {
+            if (false) {
                 path = path.substring(UI_CTX_PREFIX.length);
             } else if (isSubPath(SVC_CTX_PREFIX, path)) {
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: IllegalArgument, context prefix not present

[Killed] MethodExpression
src/uri.js:179:24
             path = path.substring(CTX.length);
         } else if (contains(toStrip, 'CTX_PREFIX')) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
-                path = path.substring(UI_CTX_PREFIX.length);
+                path = path;
             } else if (isSubPath(SVC_CTX_PREFIX, path)) {
                 path = path.substring(SVC_CTX_PREFIX.length);
killedBy: strip test: ["/a/ui/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "/a/ui/c/d/"

[Killed] BlockStatement
src/uri.js:180:57
         } else if (contains(toStrip, 'CTX_PREFIX')) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
                 path = path.substring(UI_CTX_PREFIX.length);
-            } else if (isSubPath(SVC_CTX_PREFIX, path)) {
-                path = path.substring(SVC_CTX_PREFIX.length);
-            } else {
+            } else if (isSubPath(SVC_CTX_PREFIX, path)) {} else {
                 throw new Error('IllegalArgument, context prefix not present');
             }
killedBy: strip test: ["/a/svc/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "/a/svc/c/d/"

[Killed] ConditionalExpression
src/uri.js:180:24
         } else if (contains(toStrip, 'CTX_PREFIX')) {
             if (isSubPath(UI_CTX_PREFIX, path)) {
                 path = path.substring(UI_CTX_PREFIX.length);
-            } else if (isSubPath(SVC_CTX_PREFIX, path)) {
+            } else if (true) {
                 path = path.substring(SVC_CTX_PREFIX.length);
             } else {
killedBy: strip should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] MethodExpression
src/uri.js:181:24
             if (isSubPath(UI_CTX_PREFIX, path)) {
                 path = path.substring(UI_CTX_PREFIX.length);
             } else if (isSubPath(SVC_CTX_PREFIX, path)) {
-                path = path.substring(SVC_CTX_PREFIX.length);
+                path = path;
             } else {
                 throw new Error('IllegalArgument, context prefix not present');
killedBy: strip test: ["/a/svc/c/d/", "CTX_PREFIX", "/c/d/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/c/d/"
Received: "/a/svc/c/d/"

[Killed] BlockStatement
src/uri.js:182:20
                 path = path.substring(UI_CTX_PREFIX.length);
             } else if (isSubPath(SVC_CTX_PREFIX, path)) {
                 path = path.substring(SVC_CTX_PREFIX.length);
-            } else {
-                throw new Error('IllegalArgument, context prefix not present');
-            }
+            } else {}
         }
         if (contains(toStrip, 'EXTENSION')) {
killedBy: strip should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/uri.js:186:13
                 throw new Error('IllegalArgument, context prefix not present');
             }
         }
-        if (contains(toStrip, 'EXTENSION')) {
+        if (false) {
             const segments = uri.decodeSegments(path);
             const l = segments.length;
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] BlockStatement
src/uri.js:186:45
                 throw new Error('IllegalArgument, context prefix not present');
             }
         }
-        if (contains(toStrip, 'EXTENSION')) {
-            const segments = uri.decodeSegments(path);
-            const l = segments.length;
-            if (l) {
-                const last = segments[l - 1];
-                const dotIndex = last.indexOf('.');
-                if (dotIndex !== -1) {
-                    segments[l - 1] = last.substring(0, dotIndex);
-                    path = uri.encodeSegments(segments);
-                }
-            }
-        }
+        if (contains(toStrip, 'EXTENSION')) {}
     }
     if (contains(toStrip, 'QUERY')) {
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] ConditionalExpression
src/uri.js:189:17
         if (contains(toStrip, 'EXTENSION')) {
             const segments = uri.decodeSegments(path);
             const l = segments.length;
-            if (l) {
+            if (true) {
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
killedBy: strip test: ["http://www.google.sk", "EXTENSION", "http://www.google.sk"]
statusReason: TypeError: Cannot read properties of undefined (reading 'indexOf')

[Killed] ConditionalExpression
src/uri.js:189:17
         if (contains(toStrip, 'EXTENSION')) {
             const segments = uri.decodeSegments(path);
             const l = segments.length;
-            if (l) {
+            if (false) {
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] ArithmeticOperator
src/uri.js:190:39
             const segments = uri.decodeSegments(path);
             const l = segments.length;
             if (l) {
-                const last = segments[l - 1];
+                const last = segments[l + 1];
                 const dotIndex = last.indexOf('.');
                 if (dotIndex !== -1) {
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: TypeError: Cannot read properties of undefined (reading 'indexOf')

[Killed] UnaryOperator
src/uri.js:192:34
             if (l) {
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
-                if (dotIndex !== -1) {
+                if (dotIndex !== +1) {
                     segments[l - 1] = last.substring(0, dotIndex);
                     path = uri.encodeSegments(segments);
killedBy: strip test: ["http://www.google.sk/foo", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/"

[Killed] ConditionalExpression
src/uri.js:192:21
             if (l) {
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
-                if (dotIndex !== -1) {
+                if (true) {
                     segments[l - 1] = last.substring(0, dotIndex);
                     path = uri.encodeSegments(segments);
killedBy: strip test: ["http://www.google.sk/foo", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/"

[Killed] MethodExpression
src/uri.js:193:39
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
                 if (dotIndex !== -1) {
-                    segments[l - 1] = last.substring(0, dotIndex);
+                    segments[l - 1] = last;
                     path = uri.encodeSegments(segments);
                 }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] ArithmeticOperator
src/uri.js:193:30
                 const last = segments[l - 1];
                 const dotIndex = last.indexOf('.');
                 if (dotIndex !== -1) {
-                    segments[l - 1] = last.substring(0, dotIndex);
+                    segments[l + 1] = last.substring(0, dotIndex);
                     path = uri.encodeSegments(segments);
                 }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar//foo"

[Killed] BlockStatement
src/uri.js:199:37
             }
         }
     }
-    if (contains(toStrip, 'QUERY')) {
-        query = undefined;
-    }
+    if (contains(toStrip, 'QUERY')) {}
     if (contains(toStrip, 'FRAGMENT')) {
         fragment = undefined;
killedBy: strip test: ["http://www.google.sk/foo/bar?w=f#p=7", "QUERY", "http://www.google.sk/foo/bar#p=7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo/bar#p=7"
Received: "http://www.google.sk/foo/bar?w=f#p=7"

[Killed] ConditionalExpression
src/uri.js:199:9
             }
         }
     }
-    if (contains(toStrip, 'QUERY')) {
+    if (false) {
         query = undefined;
     }
killedBy: strip test: ["http://www.google.sk/foo/bar?w=f#p=7", "QUERY", "http://www.google.sk/foo/bar#p=7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo/bar#p=7"
Received: "http://www.google.sk/foo/bar?w=f#p=7"

[Killed] ConditionalExpression
src/uri.js:202:9
     if (contains(toStrip, 'QUERY')) {
         query = undefined;
     }
-    if (contains(toStrip, 'FRAGMENT')) {
+    if (true) {
         fragment = undefined;
     }
killedBy: strip test: ["http://www.google.sk/foo/bar?w=f#p=7", "ORIGIN", "/foo/bar?w=f#p=7"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/bar?w=f#p=7"
Received: "/foo/bar?w=f"

[Killed] BlockStatement
src/uri.js:202:40
     if (contains(toStrip, 'QUERY')) {
         query = undefined;
     }
-    if (contains(toStrip, 'FRAGMENT')) {
-        fragment = undefined;
-    }
+    if (contains(toStrip, 'FRAGMENT')) {}
     return uri.recomposeComponents({ scheme, authority, host, port, userInfo, path, query, fragment });
 }
killedBy: strip test: ["http://www.google.sk/foo/bar?w=f#p=7", "PATH,FRAGMENT", "http://www.google.sk?w=f"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk?w=f"
Received: "http://www.google.sk?w=f#p=7"

[Killed] BlockStatement
src/uri.js:216:47
  * @memberof module:Uri
  * @returns {boolean} True if URIs are equal, false otherwise.
  */
-function equals(that1, that2, ignoreFragment) {
-    const { scheme, authority, path, query, fragment } = param(that1);
-    const { scheme: scheme2, authority: authority2, path: path2, query: query2, fragment: fragment2 } = param(that2);
-
-    return scheme === scheme2 && // return Boolean
-        authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
-        (ignoreFragment || fragment === fragment2);
-}
+function equals(that1, that2, ignoreFragment) {}
 
 // basic getters
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/uri.js:220:12
     const { scheme, authority, path, query, fragment } = param(that1);
     const { scheme: scheme2, authority: authority2, path: path2, query: query2, fragment: fragment2 } = param(that2);
 
-    return scheme === scheme2 && // return Boolean
-        authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
-        (ignoreFragment || fragment === fragment2);
+    return false;
 }
 
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/uri.js:220:12
     const { scheme, authority, path, query, fragment } = param(that1);
     const { scheme: scheme2, authority: authority2, path: path2, query: query2, fragment: fragment2 } = param(that2);
 
-    return scheme === scheme2 && // return Boolean
-        authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
-        (ignoreFragment || fragment === fragment2);
+    return scheme === scheme2 &&
+// return Boolean
+authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) || ignoreFragment || fragment === fragment2;
 }
 
killedBy: equals test: ["http://www.google.sk", "http://www.bar.cz", false, false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/uri.js:221:37
     const { scheme: scheme2, authority: authority2, path: path2, query: query2, fragment: fragment2 } = param(that2);
 
     return scheme === scheme2 && // return Boolean
-        authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
+        authority === authority2 && path !== path2 && this.equalsQueryStr(query, query2) &&
         (ignoreFragment || fragment === fragment2);
 }
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/uri.js:221:9
     const { scheme: scheme2, authority: authority2, path: path2, query: query2, fragment: fragment2 } = param(that2);
 
     return scheme === scheme2 && // return Boolean
-        authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
+        // return Boolean
+authority !== authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
         (ignoreFragment || fragment === fragment2);
 }
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
