[Killed] ConditionalExpression
src/uri.js:222:28
 
     return scheme === scheme2 && // return Boolean
         authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
-        (ignoreFragment || fragment === fragment2);
+        (ignoreFragment || false);
 }
 
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/uri.js:222:28
 
     return scheme === scheme2 && // return Boolean
         authority === authority2 && path === path2 && this.equalsQueryStr(query, query2) &&
-        (ignoreFragment || fragment === fragment2);
+        (ignoreFragment || fragment !== fragment2);
 }
 
killedBy: equals test: ["http://www.google.sk#w=3", "http://www.google.sk#w=3", false, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/uri.js:232:26
  * @memberof module:Uri
  * @returns {string|undefined} String without ':' delimiter.
  */
-function getScheme(that) {
-    const { scheme } = param(that);
-    return scheme;
-}
+function getScheme(that) {}
 
 /**
killedBy: basic getters test getScheme test: [null, "http"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http"
Received: undefined

[Killed] BlockStatement
src/uri.js:243:29
  * @memberof module:Uri
  * @returns {string|undefined}
  */
-function getAuthority(that) {
-    const { authority } = param(that);
-    return authority;
-}
+function getAuthority(that) {}
 
 /**
killedBy: basic getters test getAuthority test: [null, "localhost"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "localhost"
Received: undefined

[Killed] BlockStatement
src/uri.js:254:28
  * @memberof module:Uri
  * @returns {string|undefined}
  */
-function getUserInfo(that) {
-    const { userInfo } = param(that);
-    return userInfo;
-}
+function getUserInfo(that) {}
 
 /**
killedBy: basic getters test getUserInfo test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "username:password"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "username:password"
Received: undefined

[Killed] BlockStatement
src/uri.js:265:24
  * @memberof module:Uri
  * @returns {string|undefined}
  */
-function getHost(that) {
-    const { host } = param(that);
-    return host;
-}
+function getHost(that) {}
 
 /**
killedBy: basic getters test getHost test: [null, "localhost"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "localhost"
Received: undefined

[Killed] BlockStatement
src/uri.js:276:24
  * @memberof module:Uri
  * @returns {string|undefined}
  */
-function getPort(that) {
-    const { port } = param(that);
-    return port;
-}
+function getPort(that) {}
 
 /**
killedBy: basic getters test getPort test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "8042"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "8042"
Received: undefined

[Killed] BlockStatement
src/uri.js:287:24
  * @memberof module:Uri
  * @returns {string|undefined} String starting by '/'.
  */
-function getPath(that) {
-    const { path } = param(that);
-    return path;
-}
+function getPath(that) {}
 
 /**
killedBy: basic getters test getPath test: [null, "/foo/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/"
Received: undefined

[Killed] BlockStatement
src/uri.js:299:35
  * @memberof module:Uri
  * @returns {string|UriObj|undefined} String without '?' delimiter or key-value object.
  */
-function getQuery(that, toObject) {
-    const { query } = param(that);
-
-    if (toObject) {
-        return query === undefined ? undefined : //
-            uri.parseQuery(query, true); // '' -> {}
-    }
-    return query; // 1:1 with small uri.js, undefined, '' or string
-}
+function getQuery(that, toObject) {}
 
 /**
killedBy: basic getters test getQuery test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "type=animal&name=narwhal"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "type=animal&name=narwhal"
Received: undefined

[Killed] BlockStatement
src/uri.js:302:19
 function getQuery(that, toObject) {
     const { query } = param(that);
 
-    if (toObject) {
-        return query === undefined ? undefined : //
-            uri.parseQuery(query, true); // '' -> {}
-    }
+    if (toObject) {}
     return query; // 1:1 with small uri.js, undefined, '' or string
 }
killedBy: basic getters test getQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", true], {"name": "narwhal", "type": "animal"}]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "narwhal", "type": "animal"}
Received: "type=animal&name=narwhal"

[Killed] ConditionalExpression
src/uri.js:302:9
 function getQuery(that, toObject) {
     const { query } = param(that);
 
-    if (toObject) {
+    if (true) {
         return query === undefined ? undefined : //
             uri.parseQuery(query, true); // '' -> {}
killedBy: basic getters test getQuery test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "type=animal&name=narwhal"]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "type=animal&name=narwhal"
Received: {"name": "narwhal", "type": "animal"}

[Killed] ConditionalExpression
src/uri.js:303:16
     const { query } = param(that);
 
     if (toObject) {
-        return query === undefined ? undefined : //
+        return true ? undefined : //
             uri.parseQuery(query, true); // '' -> {}
     }
killedBy: basic getters test getQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", true], {"name": "narwhal", "type": "animal"}]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "narwhal", "type": "animal"}
Received: undefined

[Killed] ConditionalExpression
src/uri.js:303:16
     const { query } = param(that);
 
     if (toObject) {
-        return query === undefined ? undefined : //
+        return false ? undefined : //
             uri.parseQuery(query, true); // '' -> {}
     }
killedBy: basic getters test getQuery test: [["/", true], undefined]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: null

[Killed] BooleanLiteral
src/uri.js:304:35
 
     if (toObject) {
         return query === undefined ? undefined : //
-            uri.parseQuery(query, true); // '' -> {}
+            uri.parseQuery(query, false); // '' -> {}
     }
     return query; // 1:1 with small uri.js, undefined, '' or string
killedBy: basic getters test getQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?%EC%96%B8%EC%96%B4=%ED%95%9C%EA%B5%AD%EC%96%B4#nose", true], {"언어": "한국어"}]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "언어": "한국어",
+   "%EC%96%B8%EC%96%B4": "%ED%95%9C%EA%B5%AD%EC%96%B4",

[Killed] BlockStatement
src/uri.js:315:28
  * @memberof module:Uri
  * @returns {string|undefined} String without '#' delimiter.
  */
-function getFragment(that) {
-    const { fragment } = param(that);
-    // NTH: implement toObject
-    //			if (toObject && u.fragment != null) {
-    //				return ioQuery.queryToObject(u.fragment) || u.fragment;
-    //			}
-    return fragment;
-}
+function getFragment(that) {}
 
 /**
killedBy: basic getters test getFragment test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "nose"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:330:28
  * @memberof module:Uri
  * @returns {Array<string>} Array of strings, last is '' if path denotes a folder.
  */
-function getSegments(that) {
-    const { path } = param(that);
-    return uri.decodeSegments(path);
-}
+function getSegments(that) {}
 
 // basic setters
killedBy: basic getters test getSegmentsData test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ["over", "there", "index.x.dtb"]]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["over", "there", "index.x.dtb"]
Received: undefined

[Killed] BlockStatement
src/uri.js:343:34
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setScheme(that, scheme) {
-    const u = param(that);
-
-    return uri.recomposeComponents({
-        ...u,
-        scheme
-    });
-}
+function setScheme(that, scheme) {}
 
 /**
killedBy: basic setters test setScheme test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "//username:password@my.example.com:8042/over/there/inde
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "//username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:359:40
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setAuthority(that, authority) {
-    const u = param(that);
-
-    u.authority = authority;
-    if (authority) {
-        // NTH: uri.decomposeAuthorityComponents function
-        const { userInfo, host, port } = uri.decomposeComponents(`//${authority}`);
-        Object.assign(u, { userInfo, host, port });
-    } else {
-        u.userInfo = u.host = u.port = undefined;
-    }
-    return uri.recomposeComponents(u);
-}
+function setAuthority(that, authority) {}
 
 /**
killedBy: basic setters test setAuthority test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "foo:/over/there/index.x.dtb?type=animal&name=narwhal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo:/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:363:9
     const u = param(that);
 
     u.authority = authority;
-    if (authority) {
+    if (true) {
         // NTH: uri.decomposeAuthorityComponents function
         const { userInfo, host, port } = uri.decomposeComponents(`//${authority}`);
killedBy: basic setters test setAuthority test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "foo:/over/there/index.x.dtb?type=animal&name=narwhal
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/uri.js:363:9
     const u = param(that);
 
     u.authority = authority;
-    if (authority) {
+    if (false) {
         // NTH: uri.decomposeAuthorityComponents function
         const { userInfo, host, port } = uri.decomposeComponents(`//${authority}`);
killedBy: basic setters test setAuthority test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "localhost:8080"], "foo://localhost:8080/over/there/index.x.
statusReason: Error: Illegal host:undefined

[Killed] BlockStatement
src/uri.js:380:38
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setUserInfo(that, userInfo) {
-    const u = param(that);
-
-    return uri.recomposeComponents({
-        ...u,
-        userInfo,
-        authority: uri.recomposeAuthorityComponents(userInfo, u.host, u.port)
-    });
-}
+function setUserInfo(that, userInfo) {}
 
 /**
killedBy: basic setters test setUserInfo test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "foo://my.example.com:8042/over/there/index.x.dtb?type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] ObjectLiteral
src/uri.js:383:36
 function setUserInfo(that, userInfo) {
     const u = param(that);
 
-    return uri.recomposeComponents({
-        ...u,
-        userInfo,
-        authority: uri.recomposeAuthorityComponents(userInfo, u.host, u.port)
-    });
+    return uri.recomposeComponents({});
 }
 
killedBy: basic setters test setUserInfo test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "foo://my.example.com:8042/over/there/index.x.dtb?type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: "undefined"

[Killed] BlockStatement
src/uri.js:397:30
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setHost(that, host) {
-    const u = param(that);
-    return uri.recomposeComponents({
-        ...u,
-        host,
-        authority: uri.recomposeAuthorityComponents(u.userInfo, host, u.port)
-    });
-}
+function setHost(that, host) {}
 
 /**
killedBy: basic setters test setHost test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "localhost"], "foo://username:password@localhost:8042/over/there/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@localhost:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:413:30
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setPort(that, port) {
-    const u = param(that);
-    return uri.recomposeComponents({
-        ...u,
-        port,
-        authority: uri.recomposeAuthorityComponents(u.userInfo, u.host, port)
-    });
-}
+function setPort(that, port) {}
 
 /**
killedBy: basic setters test setPort test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", null], "foo://username:password@my.example.com/over/there/index.x
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:429:30
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setPath(that, path) {
-    const u = param(that);
-    uri.checkSegmentsEncoding(path, true); // throws error is unencoded
-
-    return uri.recomposeComponents({
-        ...u,
-        path
-    });
-}
+function setPath(that, path) {}
 
 /**
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b/c"], "foo://username:password@my.example.com:8042/a/b/c?typ
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/a/b/c?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BooleanLiteral
src/uri.js:431:37
  */
 function setPath(that, path) {
     const u = param(that);
-    uri.checkSegmentsEncoding(path, true); // throws error is unencoded
+    uri.checkSegmentsEncoding(path, false); // throws error is unencoded
 
     return uri.recomposeComponents({
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] ObjectLiteral
src/uri.js:433:36
     const u = param(that);
     uri.checkSegmentsEncoding(path, true); // throws error is unencoded
 
-    return uri.recomposeComponents({
-        ...u,
-        path
-    });
+    return uri.recomposeComponents({});
 }
 
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b/c"], "foo://username:password@my.example.com:8042/a/b/c?typ
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/a/b/c?type=animal&name=narwhal#nose"
Received: "undefined"

[Killed] BlockStatement
src/uri.js:446:32
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setQuery(that, query) {
-    const u = param(that);
-    query && typeof query != 'string' && (query = querystring.stringify(query));
-    uri.checkQueryEncoding(query, true); // throws error is unencoded
-    u.query = query;
-    return uri.recomposeComponents(u);
-}
+function setQuery(that, query) {}
 
 /**
killedBy: basic setters test setQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/ind
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?#nose"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:448:5
  */
 function setQuery(that, query) {
     const u = param(that);
-    query && typeof query != 'string' && (query = querystring.stringify(query));
+    false;
     uri.checkQueryEncoding(query, true); // throws error is unencoded
     u.query = query;
killedBy: basic setters test setQuery test: [["/foo/#nose", [Object]], "/foo/?%EC%96%B8%EC%96%B4=%ED%95%9C%EA%B5%AD%EC%96%B4#nose"]
statusReason: TypeError: raw.match is not a function

[Killed] ConditionalExpression
src/uri.js:448:14
  */
 function setQuery(that, query) {
     const u = param(that);
-    query && typeof query != 'string' && (query = querystring.stringify(query));
+    query && true && (query = querystring.stringify(query));
     uri.checkQueryEncoding(query, true); // throws error is unencoded
     u.query = query;
killedBy: basic setters test setQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:8042/ove
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?search=newt#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?#nose"

[Survived] BooleanLiteral
src/uri.js:449:35
 function setQuery(that, query) {
     const u = param(that);
     query && typeof query != 'string' && (query = querystring.stringify(query));
-    uri.checkQueryEncoding(query, true); // throws error is unencoded
+    uri.checkQueryEncoding(query, false); // throws error is unencoded
     u.query = query;
     return uri.recomposeComponents(u);

[Killed] BlockStatement
src/uri.js:461:35
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function appendQuery(that, query) {
-    if (!query) {
-        return paramString(that);
-    }
-    const origQuery = this.getQuery(that);
-    typeof query != 'string' && (query = querystring.stringify(query));
-    return this.setQuery(that, `${origQuery ? `${origQuery}&` : ''}${query}`);
-}
+function appendQuery(that, query) {}
 
 /**
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:462:9
  * @returns {string} Modified copy of `that`.
  */
 function appendQuery(that, query) {
-    if (!query) {
+    if (false) {
         return paramString(that);
     }
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&#nose"

[Killed] BlockStatement
src/uri.js:462:17
  * @returns {string} Modified copy of `that`.
  */
 function appendQuery(that, query) {
-    if (!query) {
-        return paramString(that);
-    }
+    if (!query) {}
     const origQuery = this.getQuery(that);
     typeof query != 'string' && (query = querystring.stringify(query));
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&#nose"

[Killed] ConditionalExpression
src/uri.js:466:5
         return paramString(that);
     }
     const origQuery = this.getQuery(that);
-    typeof query != 'string' && (query = querystring.stringify(query));
+    false;
     return this.setQuery(that, `${origQuery ? `${origQuery}&` : ''}${query}`);
 }
killedBy: basic setters test appendQuery test: [["/foo/bar/baz", [Object]], "/foo/bar/baz?search=newt"]
statusReason: Error: Illegal PCHAR sequence:[

[Killed] ConditionalExpression
src/uri.js:466:5
         return paramString(that);
     }
     const origQuery = this.getQuery(that);
-    typeof query != 'string' && (query = querystring.stringify(query));
+    true && (query = querystring.stringify(query));
     return this.setQuery(that, `${origQuery ? `${origQuery}&` : ''}${query}`);
 }
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:8042/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&search=newt#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&#nose"

[Killed] StringLiteral
src/uri.js:467:32
     }
     const origQuery = this.getQuery(that);
     typeof query != 'string' && (query = querystring.stringify(query));
-    return this.setQuery(that, `${origQuery ? `${origQuery}&` : ''}${query}`);
+    return this.setQuery(that, ``);
 }
 
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:8042/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&search=newt#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?#nose"

[Killed] StringLiteral
src/uri.js:467:47
     }
     const origQuery = this.getQuery(that);
     typeof query != 'string' && (query = querystring.stringify(query));
-    return this.setQuery(that, `${origQuery ? `${origQuery}&` : ''}${query}`);
+    return this.setQuery(that, `${origQuery ? `` : ''}${query}`);
 }
 
killedBy: basic setters test appendQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:8042/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal&search=newt#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?search=newt#nose"

[Killed] BlockStatement
src/uri.js:477:38
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setFragment(that, fragment) {
-    const u = param(that);
-    fragment && typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
-    uri.checkFragmentEncoding(fragment, true); // throws error is unencoded
-    u.fragment = fragment;
-    return uri.recomposeComponents(u);
-}
+function setFragment(that, fragment) {}
 
 /**
killedBy: basic setters test setFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#"
Received: undefined

[Killed] EqualityOperator
src/uri.js:479:17
  */
 function setFragment(that, fragment) {
     const u = param(that);
-    fragment && typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
+    fragment && typeof fragment == 'string' && (fragment = querystring.stringify(fragment));
     uri.checkFragmentEncoding(fragment, true); // throws error is unencoded
     u.fragment = fragment;
killedBy: basic setters test setFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "puf"], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#puf"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#"

[Killed] ConditionalExpression
src/uri.js:479:17
  */
 function setFragment(that, fragment) {
     const u = param(that);
-    fragment && typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
+    fragment && true && (fragment = querystring.stringify(fragment));
     uri.checkFragmentEncoding(fragment, true); // throws error is unencoded
     u.fragment = fragment;
killedBy: basic setters test setFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "puf"], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#puf"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#"

[Survived] BooleanLiteral
src/uri.js:480:41
 function setFragment(that, fragment) {
     const u = param(that);
     fragment && typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
-    uri.checkFragmentEncoding(fragment, true); // throws error is unencoded
+    uri.checkFragmentEncoding(fragment, false); // throws error is unencoded
     u.fragment = fragment;
     return uri.recomposeComponents(u);

[Killed] BlockStatement
src/uri.js:492:41
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function appendFragment(that, fragment) {
-    if (!fragment) {
-        return paramString(that);
-    }
-    const origFragment = this.getFragment(that);
-    typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
-    return this.setFragment(that, `${origFragment ? `${origFragment}&` : ''}${fragment}`); // return String
-}
+function appendFragment(that, fragment) {}
 
 /**
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:493:20
  * @returns {string} Modified copy of `that`.
  */
 function appendFragment(that, fragment) {
-    if (!fragment) {
-        return paramString(that);
-    }
+    if (!fragment) {}
     const origFragment = this.getFragment(that);
     typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&"
