[Killed] BooleanLiteral
src/uri.js:493:9
  * @returns {string} Modified copy of `that`.
  */
 function appendFragment(that, fragment) {
-    if (!fragment) {
+    if (fragment) {
         return paramString(that);
     }
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&"

[Killed] LogicalOperator
src/uri.js:497:5
         return paramString(that);
     }
     const origFragment = this.getFragment(that);
-    typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
+    typeof fragment != 'string' || (fragment = querystring.stringify(fragment));
     return this.setFragment(that, `${origFragment ? `${origFragment}&` : ''}${fragment}`); // return String
 }
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&search=newt"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&"

[Killed] ConditionalExpression
src/uri.js:497:5
         return paramString(that);
     }
     const origFragment = this.getFragment(that);
-    typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
+    true;
     return this.setFragment(that, `${origFragment ? `${origFragment}&` : ''}${fragment}`); // return String
 }
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", [Object]], "foo://username:password@my.example.com:8042/ov
statusReason: Error: Illegal PCHAR sequence:[

[Killed] StringLiteral
src/uri.js:498:35
     }
     const origFragment = this.getFragment(that);
     typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
-    return this.setFragment(that, `${origFragment ? `${origFragment}&` : ''}${fragment}`); // return String
+    return this.setFragment(that, ``); // return String
 }
 
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&search=newt"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#"

[Killed] StringLiteral
src/uri.js:498:53
     }
     const origFragment = this.getFragment(that);
     typeof fragment != 'string' && (fragment = querystring.stringify(fragment));
-    return this.setFragment(that, `${origFragment ? `${origFragment}&` : ''}${fragment}`); // return String
+    return this.setFragment(that, `${origFragment ? `` : ''}${fragment}`); // return String
 }
 
killedBy: basic setters test appendFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "search=newt"], "foo://username:password@my.example.com:80
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose&search=newt"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#search=newt"

[Killed] BlockStatement
src/uri.js:508:38
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function setSegments(that, segments) {
-    return this.setPath(that, uri.encodeSegments(segments));
-}
+function setSegments(that, segments) {}
 
 /**
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:519:49
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function appendSegments(that, ...appendSegmets) {
-    (Array.isArray(appendSegmets[0])) && (appendSegmets = appendSegmets[0]);
-    if (!appendSegmets.length) {
-        throw new Error('IllegalArgument, segments argument not present');
-    }
-    const segments = this.getSegments(that);
-    !segments[segments.length - 1] && segments.pop(); // isLastSegmentEmpty
-    return this.setSegments(that, segments.concat(appendSegmets));
-}
+function appendSegments(that, ...appendSegmets) {}
 
 // stripping specific parts of URI
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/?type=animal&name=narwhal#nose"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:520:5
  * @returns {string} Modified copy of `that`.
  */
 function appendSegments(that, ...appendSegmets) {
-    (Array.isArray(appendSegmets[0])) && (appendSegmets = appendSegmets[0]);
+    true;
     if (!appendSegmets.length) {
         throw new Error('IllegalArgument, segments argument not present');
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", [Array]], "foo://username:password@my.example.com:8042/ove
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/aaa/bbb?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/aaabbb?type=animal&name=narwhal#nose"

[Killed] LogicalOperator
src/uri.js:520:5
  * @returns {string} Modified copy of `that`.
  */
 function appendSegments(that, ...appendSegmets) {
-    (Array.isArray(appendSegmets[0])) && (appendSegmets = appendSegmets[0]);
+    Array.isArray(appendSegmets[0]) || (appendSegmets = appendSegmets[0]);
     if (!appendSegmets.length) {
         throw new Error('IllegalArgument, segments argument not present');
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: IllegalArgument, segments argument not present

[Killed] ConditionalExpression
src/uri.js:521:9
  */
 function appendSegments(that, ...appendSegmets) {
     (Array.isArray(appendSegmets[0])) && (appendSegmets = appendSegmets[0]);
-    if (!appendSegmets.length) {
+    if (true) {
         throw new Error('IllegalArgument, segments argument not present');
     }
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: IllegalArgument, segments argument not present

[Killed] BooleanLiteral
src/uri.js:521:9
  */
 function appendSegments(that, ...appendSegmets) {
     (Array.isArray(appendSegmets[0])) && (appendSegmets = appendSegmets[0]);
-    if (!appendSegmets.length) {
+    if (appendSegmets.length) {
         throw new Error('IllegalArgument, segments argument not present');
     }
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: IllegalArgument, segments argument not present

[Killed] BooleanLiteral
src/uri.js:525:5
         throw new Error('IllegalArgument, segments argument not present');
     }
     const segments = this.getSegments(that);
-    !segments[segments.length - 1] && segments.pop(); // isLastSegmentEmpty
+    segments[segments.length - 1] && segments.pop(); // isLastSegmentEmpty
     return this.setSegments(that, segments.concat(appendSegmets));
 }
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"

[Killed] ArithmeticOperator
src/uri.js:525:15
         throw new Error('IllegalArgument, segments argument not present');
     }
     const segments = this.getSegments(that);
-    !segments[segments.length - 1] && segments.pop(); // isLastSegmentEmpty
+    !segments[segments.length + 1] && segments.pop(); // isLastSegmentEmpty
     return this.setSegments(that, segments.concat(appendSegmets));
 }
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"

[Killed] BlockStatement
src/uri.js:536:28
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripOrigin(that) {
-    return this.strip(that, 'ORIGIN');
-}
+function stripOrigin(that) {}
 
 /**
killedBy: stripOrigin test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/over/there/index.x.dtb?type=animal&name=narwhal#nose"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/over/there/index.x.dtb?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:547:31
  * @returns {string} Modified copy of `that`.
  * @example Uri.stripExtension('/samples/ui/test/aam-test.standalone'); // '/samples/ui/test/aam-test'
  */
-function stripExtension(that) {
-    return this.strip(that, 'EXTENSION');
-}
+function stripExtension(that) {}
 
 /**
killedBy: stripExtension test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/index?type=animal&name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:557:29
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripCtxPath(that) {
-    return this.strip(that, 'ORIGIN,CTX');
-}
+function stripCtxPath(that) {}
 
 /**
killedBy: stripCtx should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, context not present"

Received function did not throw

[Killed] StringLiteral
src/uri.js:558:29
  * @returns {string} Modified copy of `that`.
  */
 function stripCtxPath(that) {
-    return this.strip(that, 'ORIGIN,CTX');
+    return this.strip(that, "");
 }
 
killedBy: stripCtx should throw error when we try to strip CTX_PREFIX that does not exist
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, context not present"

Received function did not throw

[Killed] BlockStatement
src/uri.js:567:31
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripCtxPrefix(that) {
-    return this.strip(that, 'ORIGIN,CTX_PREFIX');
-}
+function stripCtxPrefix(that) {}
 
 /**
killedBy: stripCtxPrefix test: ["/a/ui/a/b/1", "/a/b/1"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/b/1"
Received: undefined

[Killed] BlockStatement
src/uri.js:577:26
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripPath(that) {
-    return this.strip(that, 'PATH,QUERY,FRAGMENT');
-}
+function stripPath(that) {}
 
 /**
killedBy: stripPath test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042"
Received: undefined

[Killed] StringLiteral
src/uri.js:578:29
  * @returns {string} Modified copy of `that`.
  */
 function stripPath(that) {
-    return this.strip(that, 'PATH,QUERY,FRAGMENT');
+    return this.strip(that, "");
 }
 
killedBy: stripPath test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"

[Killed] BlockStatement
src/uri.js:587:27
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripQuery(that) {
-    return this.strip(that, 'QUERY');
-}
+function stripQuery(that) {}
 
 /**
killedBy: stripQuery test: ["http://www.google.sk", "http://www.google.sk"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk"
Received: undefined

[Killed] BlockStatement
src/uri.js:597:30
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function stripFragment(that) {
-    return this.strip(that, 'FRAGMENT');
-}
+function stripFragment(that) {}
 
 /**
killedBy: stripFragment test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal"
Received: undefined

[Killed] BlockStatement
src/uri.js:607:30
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function getScreenPath(that) {
-    return this.strip(that, 'ORIGIN,CTX,EXTENSION,QUERY,FRAGMENT');
-}
+function getScreenPath(that) {}
 
 /**
killedBy: getScreenPath test: ["http://www.google.sk/a/ui/this.exe", "/ui/this"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/ui/this"
Received: undefined

[Killed] StringLiteral
src/uri.js:608:29
  * @returns {string} Modified copy of `that`.
  */
 function getScreenPath(that) {
-    return this.strip(that, 'ORIGIN,CTX,EXTENSION,QUERY,FRAGMENT');
+    return this.strip(that, "");
 }
 
killedBy: getScreenPath test: ["http://www.google.sk/a/ui/this.exe", "/ui/this"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/ui/this"
Received: "http://www.google.sk/a/ui/this.exe"

[Killed] BlockStatement
src/uri.js:617:31
  * @memberof module:Uri
  * @returns {string} Empty string when `that` denotes folder, `undefined` if path is empty.
  */
-function getLastSegment(that) {
-    const { path } = param(that);
-    return uri.decodeSegments(path).pop();
-}
+function getLastSegment(that) {}
 
 // NTH: getLastNonVoidSegment ???
killedBy: denotesFolder test: ["/a/b/", true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/uri.js:629:30
  * @memberof module:Uri
  * @returns {boolean}
  */
-function denotesFolder(that) {
-    // will be string so this should be enough
-    return this.getLastSegment(that) === '';
-}
+function denotesFolder(that) {}
 
 /**
killedBy: denotesFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/uri.js:631:12
  */
 function denotesFolder(that) {
     // will be string so this should be enough
-    return this.getLastSegment(that) === '';
+    return false;
 }
 
killedBy: denotesFolder test: ["/a/b/", true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/uri.js:631:12
  */
 function denotesFolder(that) {
     // will be string so this should be enough
-    return this.getLastSegment(that) === '';
+    return true;
 }
 
killedBy: denotesFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/uri.js:641:32
  * @returns {string} Modified copy of `that` ending with '/'.
  * @example Uri.convertToFolder('/samples/ui/test/aam-test');	// 	'/samples/ui/test/'
  */
-function convertToFolder(that) {
-    let { path, ...others } = param(that);
-    const segments = uri.decodeSegments(path);
-    if (segments.length) {
-        segments[segments.length - 1] = '';
-    } else {
-        segments.push('');
-    }
-    path = uri.encodeSegments(segments);
-    return uri.recomposeComponents({ path, ...others });
-}
+function convertToFolder(that) {}
 
 /**
killedBy: convertToFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/?type=animal&name=nar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"
Received: undefined

[Killed] BlockStatement
src/uri.js:644:26
 function convertToFolder(that) {
     let { path, ...others } = param(that);
     const segments = uri.decodeSegments(path);
-    if (segments.length) {
-        segments[segments.length - 1] = '';
-    } else {
+    if (segments.length) {} else {
         segments.push('');
     }
killedBy: convertToFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/?type=animal&name=nar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose"

[Killed] ConditionalExpression
src/uri.js:644:9
 function convertToFolder(that) {
     let { path, ...others } = param(that);
     const segments = uri.decodeSegments(path);
-    if (segments.length) {
+    if (true) {
         segments[segments.length - 1] = '';
     } else {
killedBy: convertToFolder test: ["", "/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: ""

[Killed] ArithmeticOperator
src/uri.js:645:18
     let { path, ...others } = param(that);
     const segments = uri.decodeSegments(path);
     if (segments.length) {
-        segments[segments.length - 1] = '';
+        segments[segments.length + 1] = '';
     } else {
         segments.push('');
killedBy: convertToFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/?type=animal&name=nar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/over/there/index.x.dtb//?type=animal&name=narwhal#nose"

[Killed] BlockStatement
src/uri.js:646:12
     const segments = uri.decodeSegments(path);
     if (segments.length) {
         segments[segments.length - 1] = '';
-    } else {
-        segments.push('');
-    }
+    } else {}
     path = uri.encodeSegments(segments);
     return uri.recomposeComponents({ path, ...others });
killedBy: convertToFolder test: ["", "/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: ""

[Killed] StringLiteral
src/uri.js:647:23
     if (segments.length) {
         segments[segments.length - 1] = '';
     } else {
-        segments.push('');
+        segments.push("Stryker was here!");
     }
     path = uri.encodeSegments(segments);
killedBy: convertToFolder test: ["", "/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/"
Received: "/Stryker%20was%20here!"

[Killed] ObjectLiteral
src/uri.js:650:36
         segments.push('');
     }
     path = uri.encodeSegments(segments);
-    return uri.recomposeComponents({ path, ...others });
+    return uri.recomposeComponents({});
 }
 
killedBy: convertToFolder test: ["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "foo://username:password@my.example.com:8042/over/there/?type=animal&name=nar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/?type=animal&name=narwhal#nose"
Received: "undefined"

[Killed] BlockStatement
src/uri.js:660:35
  * @memberof module:Uri
  * @returns {boolean} True if `ref` is subordinate of `base`.
  */
-function isSubordinate(that, ref) {
-    return uri.isSubordinate(param(that), param(ref), true);
-}
+function isSubordinate(that, ref) {}
 
 /**
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Survived] BooleanLiteral
src/uri.js:661:55
  * @returns {boolean} True if `ref` is subordinate of `base`.
  */
 function isSubordinate(that, ref) {
-    return uri.isSubordinate(param(that), param(ref), true);
+    return uri.isSubordinate(param(that), param(ref), false);
 }
 

[Killed] BlockStatement
src/uri.js:671:29
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function resolve(that, ref) {
-    const s = _resolve(param(that), param(ref));
-    return uri.recomposeComponents(s);
-}
+function resolve(that, ref) {}
 
 /**
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: undefined

[Killed] BlockStatement
src/uri.js:683:42
  * @memberof module:Uri
  * @returns {string} Modified copy of `that`.
  */
-function resolveAsSubordinate(that, ref) {
-    const u = param(convertToFolder(that));
-    const s = _resolve(u, param(ref));
-    if (!isSubordinate(u, s)) {
-        throw new Error('IllegalArgument, not subordinate');
-    }
-    return uri.recomposeComponents(s);
-}
+function resolveAsSubordinate(that, ref) {}
 
 /**
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http:/a/b"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:686:9
 function resolveAsSubordinate(that, ref) {
     const u = param(convertToFolder(that));
     const s = _resolve(u, param(ref));
-    if (!isSubordinate(u, s)) {
+    if (true) {
         throw new Error('IllegalArgument, not subordinate');
     }
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] BooleanLiteral
src/uri.js:686:9
 function resolveAsSubordinate(that, ref) {
     const u = param(convertToFolder(that));
     const s = _resolve(u, param(ref));
-    if (!isSubordinate(u, s)) {
+    if (isSubordinate(u, s)) {
         throw new Error('IllegalArgument, not subordinate');
     }
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] StringLiteral
src/uri.js:687:25
     const u = param(convertToFolder(that));
     const s = _resolve(u, param(ref));
     if (!isSubordinate(u, s)) {
-        throw new Error('IllegalArgument, not subordinate');
+        throw new Error("");
     }
     return uri.recomposeComponents(s);
killedBy: Throws error if not subordinate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, not subordinate"
Received message:   ""

      1225 |       } else {
      1226 |         stryCov_9fa48("781");
    > 1227 |         throw new Error(stryMutAct_9fa48("782") ? "" : (stryCov_9fa48("782"), 'IllegalArgument, not subordinate'));

[Killed] BlockStatement
src/uri.js:698:24
  * @memberof module:Uri
  * @returns {number} Id.
  */
-function parseId(that) {
-    const id = parseInt(getLastSegment(that), 10);
-    if (isNaN(id)) {
-        throw new Error('IllegalArgument, numeric id not present');
-    }
-    return id;
-}
+function parseId(that) {}
 
 function prependCtxPrefix(that, prefix) {
killedBy: parseId test parseId should return correct id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/uri.js:700:9
  */
 function parseId(that) {
     const id = parseInt(getLastSegment(that), 10);
-    if (isNaN(id)) {
+    if (false) {
         throw new Error('IllegalArgument, numeric id not present');
     }
killedBy: parseId test Should throw error because id can be only number: "/a/b/1/"
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/uri.js:700:9
  */
 function parseId(that) {
     const id = parseInt(getLastSegment(that), 10);
-    if (isNaN(id)) {
+    if (true) {
         throw new Error('IllegalArgument, numeric id not present');
     }
killedBy: parseId test parseId should return correct id
statusReason: Error: IllegalArgument, numeric id not present

[Killed] BlockStatement
src/uri.js:706:41
     return id;
 }
 
-function prependCtxPrefix(that, prefix) {
-    const u = param(that);
-    if (u.authority || u.scheme) {
-        throw new Error('IllegalArgument, origin not expected');
-    }
-    const segments = uri.decodeSegments(u.path);
-    const ctxSegments = uri.decodeSegments(prefix);
-    const hasPrefix = ctxSegments.every((seg, i) => segments[i] === seg);
-    if (!hasPrefix) {
-        u.path = uri.encodeSegments(ctxSegments.concat(segments));
-    }
-    return uri.recomposeComponents(u);
-}
+function prependCtxPrefix(that, prefix) {}
 
 /**
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:708:9
 
 function prependCtxPrefix(that, prefix) {
     const u = param(that);
-    if (u.authority || u.scheme) {
+    if (false) {
         throw new Error('IllegalArgument, origin not expected');
     }
killedBy: resolveUiCtx
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/uri.js:708:9
 
 function prependCtxPrefix(that, prefix) {
     const u = param(that);
-    if (u.authority || u.scheme) {
+    if (true) {
         throw new Error('IllegalArgument, origin not expected');
     }
killedBy: resolveUiCtx
statusReason: Error: IllegalArgument, origin not expected

[Survived] StringLiteral
src/uri.js:709:25
 function prependCtxPrefix(that, prefix) {
     const u = param(that);
     if (u.authority || u.scheme) {
-        throw new Error('IllegalArgument, origin not expected');
+        throw new Error("");
     }
     const segments = uri.decodeSegments(u.path);

[Killed] ConditionalExpression
src/uri.js:713:53
     }
     const segments = uri.decodeSegments(u.path);
     const ctxSegments = uri.decodeSegments(prefix);
-    const hasPrefix = ctxSegments.every((seg, i) => segments[i] === seg);
+    const hasPrefix = ctxSegments.every((seg, i) => false);
     if (!hasPrefix) {
         u.path = uri.encodeSegments(ctxSegments.concat(segments));
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: "/a/ui/a/ui/foo"

[Killed] ArrowFunction
src/uri.js:713:41
     }
     const segments = uri.decodeSegments(u.path);
     const ctxSegments = uri.decodeSegments(prefix);
-    const hasPrefix = ctxSegments.every((seg, i) => segments[i] === seg);
+    const hasPrefix = ctxSegments.every(() => undefined);
     if (!hasPrefix) {
         u.path = uri.encodeSegments(ctxSegments.concat(segments));
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: "/a/ui/a/ui/foo"
