[Killed] BlockStatement
src/uri.js:714:21
     const segments = uri.decodeSegments(u.path);
     const ctxSegments = uri.decodeSegments(prefix);
     const hasPrefix = ctxSegments.every((seg, i) => segments[i] === seg);
-    if (!hasPrefix) {
-        u.path = uri.encodeSegments(ctxSegments.concat(segments));
-    }
+    if (!hasPrefix) {}
     return uri.recomposeComponents(u);
 }
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: "/foo"

[Killed] ConditionalExpression
src/uri.js:714:9
     const segments = uri.decodeSegments(u.path);
     const ctxSegments = uri.decodeSegments(prefix);
     const hasPrefix = ctxSegments.every((seg, i) => segments[i] === seg);
-    if (!hasPrefix) {
+    if (false) {
         u.path = uri.encodeSegments(ctxSegments.concat(segments));
     }
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: "/foo"

[Killed] BlockStatement
src/uri.js:726:30
  * @memberof module:Uri
  * @returns {string}
  */
-function resolveSvcCtx(that) {
-    if (!SVC_CTX_PREFIX) {
-        throw new Error('SVC_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
-    }
-    return prependCtxPrefix(that, SVC_CTX_PREFIX);
-}
+function resolveSvcCtx(that) {}
 
 /**
killedBy: resolvesvcCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/svc/foo"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:727:9
  * @returns {string}
  */
 function resolveSvcCtx(that) {
-    if (!SVC_CTX_PREFIX) {
+    if (true) {
         throw new Error('SVC_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
     }
killedBy: resolvesvcCtx
statusReason: Error: SVC_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx

[Killed] BooleanLiteral
src/uri.js:727:9
  * @returns {string}
  */
 function resolveSvcCtx(that) {
-    if (!SVC_CTX_PREFIX) {
+    if (SVC_CTX_PREFIX) {
         throw new Error('SVC_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
     }
killedBy: resolvesvcCtx
statusReason: Error: SVC_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx

[Killed] BlockStatement
src/uri.js:739:29
  * @memberof module:Uri
  * @returns {string}
  */
-function resolveUiCtx(that) {
-    if (!UI_CTX_PREFIX) {
-        throw new Error('UI_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
-    }
-    return prependCtxPrefix(that, UI_CTX_PREFIX);
-}
+function resolveUiCtx(that) {}
 
 module.exports = {
killedBy: resolveUiCtx
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/a/ui/foo"
Received: undefined

[Killed] ConditionalExpression
src/uri.js:740:9
  * @returns {string}
  */
 function resolveUiCtx(that) {
-    if (!UI_CTX_PREFIX) {
+    if (true) {
         throw new Error('UI_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
     }
killedBy: resolveUiCtx
statusReason: Error: UI_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx

[Killed] BooleanLiteral
src/uri.js:740:9
  * @returns {string}
  */
 function resolveUiCtx(that) {
-    if (!UI_CTX_PREFIX) {
+    if (UI_CTX_PREFIX) {
         throw new Error('UI_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx');
     }
killedBy: resolveUiCtx
statusReason: Error: UI_CTX_PREFIX is not defined, use config() before calling resolveSvcCtx
