[Killed] StringLiteral
src/_uri.js:27:5
 */
 const splitUriRegex = new RegExp( // IRI lib regexp
     '^' +
-    '(([^:/?#]*):)?' + // scheme
+    "" + // scheme
     '(//((([^/?#@]*)@)?' + // user
     '(\\[[^/?#]*\\]|([^/?#:]*))?' + // host
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: ""

[Killed] StringLiteral
src/_uri.js:38:23
 ); //
 
 // TODO: get rid of RFC2396 constants
-const RFC2396_DIGIT = '0-9';
+const RFC2396_DIGIT = "";
 const RFC2396_LOWALPHA = 'a-z';
 const RFC2396_UPALPHA = 'A-Z';
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: "/%31%30/"

[Killed] ArithmeticOperator
src/_uri.js:41:23
 const RFC2396_DIGIT = '0-9';
 const RFC2396_LOWALPHA = 'a-z';
 const RFC2396_UPALPHA = 'A-Z';
-const RFC2396_ALPHA = RFC2396_LOWALPHA + RFC2396_UPALPHA;
+const RFC2396_ALPHA = RFC2396_LOWALPHA - RFC2396_UPALPHA;
 const RFC2396_ALPHANUM = RFC2396_DIGIT + RFC2396_ALPHA;
 const RFC3986_UNRESERVED = `${RFC2396_ALPHANUM}-._~`;
killedBy: uri builder test only path parameter
statusReason: SyntaxError: Invalid regular expression: /[0-9NaN-._~!$&'()*+,;=:@]/: Range out of order in character class

[Killed] ArithmeticOperator
src/_uri.js:42:26
 const RFC2396_LOWALPHA = 'a-z';
 const RFC2396_UPALPHA = 'A-Z';
 const RFC2396_ALPHA = RFC2396_LOWALPHA + RFC2396_UPALPHA;
-const RFC2396_ALPHANUM = RFC2396_DIGIT + RFC2396_ALPHA;
+const RFC2396_ALPHANUM = RFC2396_DIGIT - RFC2396_ALPHA;
 const RFC3986_UNRESERVED = `${RFC2396_ALPHANUM}-._~`;
 const RFC3986_SUBDELIMS = '!$&\'()*+,;=';
killedBy: uri builder test only path parameter
statusReason: SyntaxError: Invalid regular expression: /[NaN-._~!$&'()*+,;=:@]/: Range out of order in character class

[Killed] StringLiteral
src/_uri.js:47:23
 const RFC3986_SUBDELIMS = '!$&\'()*+,;=';
 const RFC3986_PCT_ENCODED = '';
 const RFC3986_REG_NAME = `${RFC3986_UNRESERVED}${RFC3986_PCT_ENCODED}${RFC3986_SUBDELIMS}`;
-const RFC3986_PCHAR = `${RFC3986_REG_NAME}:@`;
+const RFC3986_PCHAR = ``;
 const RFC3986_QUERY = `${RFC3986_PCHAR}?/`;
 const RFC3986_SEGMENT = RFC3986_PCHAR;
killedBy: encode query test: ["abcd", "abcd"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcd"
Received: "%61%62%63%64"

[Killed] Regex
src/_uri.js:51:25
 const RFC3986_QUERY = `${RFC3986_PCHAR}?/`;
 const RFC3986_SEGMENT = RFC3986_PCHAR;
 const RFC3986_FRAGMENT = `${RFC3986_PCHAR}?/`;
-const PCHAR_TOKENIZER = /(?:%[0-9A-Fa-f]{2}){1,}|./g;
+const PCHAR_TOKENIZER = /(?:%[0-9A-Fa-f]{2})|./g;
 const RFC3986_PATH_SEGMENTS = `${RFC3986_SEGMENT}/`;
 
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%D7%90/c"], "foo://username:password@my.example.com:8042/a/%D
statusReason: Error: Illegal PCHAR sequence:%D7

[Killed] Regex
src/_uri.js:51:25
 const RFC3986_QUERY = `${RFC3986_PCHAR}?/`;
 const RFC3986_SEGMENT = RFC3986_PCHAR;
 const RFC3986_FRAGMENT = `${RFC3986_PCHAR}?/`;
-const PCHAR_TOKENIZER = /(?:%[0-9A-Fa-f]{2}){1,}|./g;
+const PCHAR_TOKENIZER = /(?:%[0-9A-Fa-f]){1,}|./g;
 const RFC3986_PATH_SEGMENTS = `${RFC3986_SEGMENT}/`;
 
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%D7%90/c"], "foo://username:password@my.example.com:8042/a/%D
statusReason: Error: Illegal PCHAR sequence:%D

[Killed] Regex
src/_uri.js:63:41
 //	'/'		nested property marker
 //	'()'	brackets for grouping operators
 // const RQL_VALUE = `${RFC3986_UNRESERVED}${RFC3986_PCT_ENCODED}@?$'*+`;
-const RQL_VALUE = RFC3986_QUERY.replace(/[=><!,:&|/()]/g, '');
+const RQL_VALUE = RFC3986_QUERY.replace(/[^=><!,:&|/()]/g, '');
 
 /**
killedBy: uri builder test RQL query control chars are correctly ENCODED using uriBuilderRql
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/?eq(encoded,%3D%3E%3C%21%2C%3A%26%7C%2F%28%29)"
Received: "/foo/?eq(encoded,=%3E%3C!,:&%7C/())"

[Killed] ObjectLiteral
src/_uri.js:75:15
 function decomposeComponents(uriStr) {
     /* eslint-disable-next-line array-bracket-spacing */ // (formatter has problems when starting with ,)
     const [,, scheme,, authority,, userInfo, host,,, port, path,, query,, fragment ] = uriStr.match(splitUriRegex);
-    const u = { scheme, authority, path, query, fragment };
+    const u = {};
     if (u.authority != null) {
         Object.assign(u, { userInfo, port, host });
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: ""

[Killed] EqualityOperator
src/_uri.js:76:9
     /* eslint-disable-next-line array-bracket-spacing */ // (formatter has problems when starting with ,)
     const [,, scheme,, authority,, userInfo, host,,, port, path,, query,, fragment ] = uriStr.match(splitUriRegex);
     const u = { scheme, authority, path, query, fragment };
-    if (u.authority != null) {
+    if (u.authority == null) {
         Object.assign(u, { userInfo, port, host });
         // TODO: host null vs '' if authority defined but host not ?
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:76:9
     /* eslint-disable-next-line array-bracket-spacing */ // (formatter has problems when starting with ,)
     const [,, scheme,, authority,, userInfo, host,,, port, path,, query,, fragment ] = uriStr.match(splitUriRegex);
     const u = { scheme, authority, path, query, fragment };
-    if (u.authority != null) {
+    if (true) {
         Object.assign(u, { userInfo, port, host });
         // TODO: host null vs '' if authority defined but host not ?
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:79:9
     if (u.authority != null) {
         Object.assign(u, { userInfo, port, host });
         // TODO: host null vs '' if authority defined but host not ?
-        u.host == null && (u.host = '');
+        true;
     }
     u.path == null && (u.path = '');
killedBy: component test: ["http://", %p, %p]
statusReason: Error: Illegal host:undefined

[Killed] ConditionalExpression
src/_uri.js:79:9
     if (u.authority != null) {
         Object.assign(u, { userInfo, port, host });
         // TODO: host null vs '' if authority defined but host not ?
-        u.host == null && (u.host = '');
+        true && (u.host = '');
     }
     u.path == null && (u.path = '');
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:81:5
         // TODO: host null vs '' if authority defined but host not ?
         u.host == null && (u.host = '');
     }
-    u.path == null && (u.path = '');
+    true;
     return u;
 }
killedBy: resolve test: ["//g", "http://a/b/c/d;p?q", "http://g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://g"
Received: "http://gundefined"

[Killed] ConditionalExpression
src/_uri.js:81:5
         // TODO: host null vs '' if authority defined but host not ?
         u.host == null && (u.host = '');
     }
-    u.path == null && (u.path = '');
+    true && (u.path = '');
     return u;
 }
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] BlockStatement
src/_uri.js:93:61
 * @memberof module:uri
 * @returns {string}
 */
-function recomposeAuthorityComponents(userInfo, host, port) {
-    if (host == null) {
-        throw new Error(`Illegal host:${host}`);
-    }
-    let result = '';
-    result += userInfo != null ? `${userInfo}@` : '';
-    result += host;
-    result += port != null ? `:${port}` : '';
-    return result;
-}
+function recomposeAuthorityComponents(userInfo, host, port) {}
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] BlockStatement
src/_uri.js:94:23
 * @returns {string}
 */
 function recomposeAuthorityComponents(userInfo, host, port) {
-    if (host == null) {
-        throw new Error(`Illegal host:${host}`);
-    }
+    if (host == null) {}
     let result = '';
     result += userInfo != null ? `${userInfo}@` : '';
killedBy: recomposeAuthorityComponents test
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal host:null"

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:94:9
 * @returns {string}
 */
 function recomposeAuthorityComponents(userInfo, host, port) {
-    if (host == null) {
+    if (false) {
         throw new Error(`Illegal host:${host}`);
     }
killedBy: recomposeAuthorityComponents test
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal host:null"

Received function did not throw

[Killed] AssignmentOperator
src/_uri.js:98:5
         throw new Error(`Illegal host:${host}`);
     }
     let result = '';
-    result += userInfo != null ? `${userInfo}@` : '';
+    result -= userInfo != null ? `${userInfo}@` : '';
     result += host;
     result += port != null ? `:${port}` : '';
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] EqualityOperator
src/_uri.js:98:15
         throw new Error(`Illegal host:${host}`);
     }
     let result = '';
-    result += userInfo != null ? `${userInfo}@` : '';
+    result += userInfo == null ? `${userInfo}@` : '';
     result += host;
     result += port != null ? `:${port}` : '';
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] AssignmentOperator
src/_uri.js:99:5
     }
     let result = '';
     result += userInfo != null ? `${userInfo}@` : '';
-    result += host;
+    result -= host;
     result += port != null ? `:${port}` : '';
     return result;
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:100:15
     let result = '';
     result += userInfo != null ? `${userInfo}@` : '';
     result += host;
-    result += port != null ? `:${port}` : '';
+    result += true ? `:${port}` : '';
     return result;
 }
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:100:15
     let result = '';
     result += userInfo != null ? `${userInfo}@` : '';
     result += host;
-    result += port != null ? `:${port}` : '';
+    result += false ? `:${port}` : '';
     return result;
 }
killedBy: resolve test: ['./../g', 'http://john.doe@www.example.com:123', 'http://john.doe@www.example.com:123/g']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] BlockStatement
src/_uri.js:104:68
     return result;
 }
 
-function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    const b = (authority == null && userInfo == null && host == null && port == null) ||
-        (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
-    if (!b) {
-        throw new Error('IllegalStateException,AuthorityInvariant broken');
-    }
-}
+function _checkAuthorityInvariant(authority, userInfo, host, port) {}
 
 /**
killedBy: checkAuthorityInvariant should throw in recompose on invalid input
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/_uri.js:105:37
 }
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    const b = (authority == null && userInfo == null && host == null && port == null) ||
+    const b = (authority == null && userInfo != null && host == null && port == null) ||
         (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
     if (!b) {
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] LogicalOperator
src/_uri.js:105:15
 }
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    const b = (authority == null && userInfo == null && host == null && port == null) ||
-        (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
+    const b = authority == null && userInfo == null && host == null && port == null && authority != null && authority === recomposeAuthorityComponents(userInfo, host, port);
     if (!b) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] EqualityOperator
src/_uri.js:106:31
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     const b = (authority == null && userInfo == null && host == null && port == null) ||
-        (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
+        (authority != null && authority !== recomposeAuthorityComponents(userInfo, host, port));
     if (!b) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:106:31
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     const b = (authority == null && userInfo == null && host == null && port == null) ||
-        (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
+        (authority != null && true);
     if (!b) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
killedBy: checkAuthorityInvariant should throw in recompose on invalid input
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/_uri.js:107:13
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     const b = (authority == null && userInfo == null && host == null && port == null) ||
         (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
-    if (!b) {
-        throw new Error('IllegalStateException,AuthorityInvariant broken');
-    }
+    if (!b) {}
 }
 
killedBy: checkAuthorityInvariant should throw in recompose on invalid input
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
src/_uri.js:107:9
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     const b = (authority == null && userInfo == null && host == null && port == null) ||
         (authority != null && authority === recomposeAuthorityComponents(userInfo, host, port));
-    if (!b) {
+    if (b) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
     }
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] BlockStatement
src/_uri.js:122:98
 defined(x) is coded with !=null (means undefined and null are handled the same way)
 ignores "authority sub components"
 */
-function recomposeComponents({ scheme, authority, userInfo, host, port, path, query, fragment }) {
-    _checkAuthorityInvariant(authority, userInfo, host, port);
-
-    let result = '';
-    result += scheme != null ? `${scheme}:` : '';
-    result += authority != null ? `//${authority}` : '';
-    result += path;
-    result += query != null ? `?${query}` : '';
-    result += fragment != null ? `#${fragment}` : '';
-
-    return result;
-}
+function recomposeComponents({ scheme, authority, userInfo, host, port, path, query, fragment }) {}
 
 /**
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: undefined

[Killed] ConditionalExpression
src/_uri.js:126:15
     _checkAuthorityInvariant(authority, userInfo, host, port);
 
     let result = '';
-    result += scheme != null ? `${scheme}:` : '';
+    result += true ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
killedBy: resolve test: ['./../^g*', '', '^g*']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "^g*"
Received: "undefined:^g*"

[Killed] EqualityOperator
src/_uri.js:126:15
     _checkAuthorityInvariant(authority, userInfo, host, port);
 
     let result = '';
-    result += scheme != null ? `${scheme}:` : '';
+    result += scheme == null ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "h"

[Killed] ConditionalExpression
src/_uri.js:127:15
 
     let result = '';
     result += scheme != null ? `${scheme}:` : '';
-    result += authority != null ? `//${authority}` : '';
+    result += false ? `//${authority}` : '';
     result += path;
     result += query != null ? `?${query}` : '';
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http:/b/c/g"

[Killed] EqualityOperator
src/_uri.js:127:15
 
     let result = '';
     result += scheme != null ? `${scheme}:` : '';
-    result += authority != null ? `//${authority}` : '';
+    result += authority == null ? `//${authority}` : '';
     result += path;
     result += query != null ? `?${query}` : '';
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g://undefinedh"

[Killed] AssignmentOperator
src/_uri.js:128:5
     let result = '';
     result += scheme != null ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
-    result += path;
+    result -= path;
     result += query != null ? `?${query}` : '';
     result += fragment != null ? `#${fragment}` : '';
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "NaN"

[Killed] EqualityOperator
src/_uri.js:129:15
     result += scheme != null ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
-    result += query != null ? `?${query}` : '';
+    result += query == null ? `?${query}` : '';
     result += fragment != null ? `#${fragment}` : '';
 
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:h?undefined"

[Killed] ConditionalExpression
src/_uri.js:129:15
     result += scheme != null ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
-    result += query != null ? `?${query}` : '';
+    result += false ? `?${query}` : '';
     result += fragment != null ? `#${fragment}` : '';
 
killedBy: resolve test: ['?y', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?y']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?y"
Received: "http://a/b/c/d;p"

[Killed] EqualityOperator
src/_uri.js:130:15
     result += authority != null ? `//${authority}` : '';
     result += path;
     result += query != null ? `?${query}` : '';
-    result += fragment != null ? `#${fragment}` : '';
+    result += fragment == null ? `#${fragment}` : '';
 
     return result;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:h#undefined"

[Killed] ConditionalExpression
src/_uri.js:130:15
     result += authority != null ? `//${authority}` : '';
     result += path;
     result += query != null ? `?${query}` : '';
-    result += fragment != null ? `#${fragment}` : '';
+    result += false ? `#${fragment}` : '';
 
     return result;
killedBy: resolve test: ['#s', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?q#s']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?q#s"
Received: "http://a/b/c/d;p?q"

[Killed] BlockStatement
src/_uri.js:142:41
 * @memberof module:uri
 * @returns {string}
 */
-function percentEncode(str, legalRange) {
-    const retVal = Array.from(str);
-    const reLegal = legalRange && new RegExp(`[${legalRange}]`);
-    function encode(cp, i, buff) {
-        if (reLegal && cp.match(reLegal)) { return; }
-        let enc = encodeURIComponent(cp);
-        if (enc.length === 1) {
-            enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
-        }
-        buff[i] = enc;
-    }
-    retVal.forEach(encode);
-    return retVal.join('');
-}
+function percentEncode(str, legalRange) {}
 
 /**
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/"

[Killed] ConditionalExpression
src/_uri.js:144:21
 */
 function percentEncode(str, legalRange) {
     const retVal = Array.from(str);
-    const reLegal = legalRange && new RegExp(`[${legalRange}]`);
+    const reLegal = false;
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/%66%6F%6F"

[Killed] ConditionalExpression
src/_uri.js:144:21
 */
 function percentEncode(str, legalRange) {
     const retVal = Array.from(str);
-    const reLegal = legalRange && new RegExp(`[${legalRange}]`);
+    const reLegal = true;
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/%66%6F%6F"

[Killed] BlockStatement
src/_uri.js:145:34
 function percentEncode(str, legalRange) {
     const retVal = Array.from(str);
     const reLegal = legalRange && new RegExp(`[${legalRange}]`);
-    function encode(cp, i, buff) {
-        if (reLegal && cp.match(reLegal)) { return; }
-        let enc = encodeURIComponent(cp);
-        if (enc.length === 1) {
-            enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
-        }
-        buff[i] = enc;
-    }
+    function encode(cp, i, buff) {}
     retVal.forEach(encode);
     return retVal.join('');
killedBy: percentEncode test: ["/+", "+/?", "+/%3F"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+/%3F"
Received: "+/?"

[Killed] LogicalOperator
src/_uri.js:146:13
     const retVal = Array.from(str);
     const reLegal = legalRange && new RegExp(`[${legalRange}]`);
     function encode(cp, i, buff) {
-        if (reLegal && cp.match(reLegal)) { return; }
+        if (reLegal || cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
         if (enc.length === 1) {
killedBy: percentEncode test: ["/+", "+/?", "+/%3F"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+/%3F"
Received: "+/?"

[Killed] ConditionalExpression
src/_uri.js:146:13
     const retVal = Array.from(str);
     const reLegal = legalRange && new RegExp(`[${legalRange}]`);
     function encode(cp, i, buff) {
-        if (reLegal && cp.match(reLegal)) { return; }
+        if (false) { return; }
         let enc = encodeURIComponent(cp);
         if (enc.length === 1) {
killedBy: percentEncode test: ["/+", "+/?", "+/%3F"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+/%3F"
Received: "%2B%2F%3F"

[Killed] EqualityOperator
src/_uri.js:148:13
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
-        if (enc.length === 1) {
+        if (enc.length !== 1) {
             enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
         }
killedBy: percentEncode test: ["abc", "mama", "%6Da%6Da"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "%6Da%6Da"
Received: "mama"

[Killed] ConditionalExpression
src/_uri.js:148:13
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
-        if (enc.length === 1) {
+        if (false) {
             enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
         }
killedBy: percentEncode test: ["abc", "mama", "%6Da%6Da"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "%6Da%6Da"
Received: "mama"

[Killed] MethodExpression
src/_uri.js:149:23
         if (reLegal && cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
         if (enc.length === 1) {
-            enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
+            enc = `%${cp.charCodeAt(0).toString(16).toLowerCase()}`;
         }
         buff[i] = enc;
killedBy: percentEncode test: ["abc", "mama", "%6Da%6Da"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "%6Da%6Da"
Received: "%6da%6da"

[Killed] StringLiteral
src/_uri.js:149:19
         if (reLegal && cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
         if (enc.length === 1) {
-            enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
+            enc = ``;
         }
         buff[i] = enc;
killedBy: uri builder test RQL query control chars are correctly ENCODED using uriBuilderRql
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/?eq(encoded,%3D%3E%3C%21%2C%3A%26%7C%2F%28%29)"
Received: "/foo/?eq(encoded,%3D%3E%3C%2C%3A%26%7C%2F)"

[Survived] StringLiteral
src/_uri.js:167:14
     let inputBufferStart = 0;
     const inputBufferEnd = path.length;
     let output = '';
-    let xi = '';
+    let xi = "Stryker was here!";
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);

[Killed] ConditionalExpression
src/_uri.js:168:12
     const inputBufferEnd = path.length;
     let output = '';
     let xi = '';
-    while (inputBufferStart < inputBufferEnd) {
+    while (false) {
         let _in = path.substring(inputBufferStart);
         if (_in.indexOf('./') === 0) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] EqualityOperator
src/_uri.js:168:12
     const inputBufferEnd = path.length;
     let output = '';
     let xi = '';
-    while (inputBufferStart < inputBufferEnd) {
+    while (inputBufferStart >= inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
         if (_in.indexOf('./') === 0) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] MethodExpression
src/_uri.js:169:19
     let output = '';
     let xi = '';
     while (inputBufferStart < inputBufferEnd) {
-        let _in = path.substring(inputBufferStart);
+        let _in = path;
         if (_in.indexOf('./') === 0) {
             inputBufferStart += 2;
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/b/b/b"

[Killed] ConditionalExpression
src/_uri.js:170:13
     let xi = '';
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
-        if (_in.indexOf('./') === 0) {
+        if (false) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ["./../^g*", "http:", "http:^g*"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http:^g*"
Received: "http:./^g*"

[Killed] BlockStatement
src/_uri.js:170:38
     let xi = '';
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
-        if (_in.indexOf('./') === 0) {
-            inputBufferStart += 2;
-            continue;
-        }
+        if (_in.indexOf('./') === 0) {}
         if (_in.indexOf('../') === 0) {
             inputBufferStart += 3;
killedBy: resolve test: ['./../^g*', 'http:', 'http:^g*']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http:^g*"
Received: "http:./^g*"
