[Timeout] AssignmentOperator
src/_uri.js:171:13
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
         if (_in.indexOf('./') === 0) {
-            inputBufferStart += 2;
+            inputBufferStart -= 2;
             continue;
         }

[Killed] EqualityOperator
src/_uri.js:174:13
             inputBufferStart += 2;
             continue;
         }
-        if (_in.indexOf('../') === 0) {
+        if (_in.indexOf('../') !== 0) {
             inputBufferStart += 3;
             continue;
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:174:13
             inputBufferStart += 2;
             continue;
         }
-        if (_in.indexOf('../') === 0) {
+        if (false) {
             inputBufferStart += 3;
             continue;
killedBy: resolve test: ['./../^g*', 'http:', 'http:^g*']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http:^g*"
Received: "http:../^g*"

[Timeout] AssignmentOperator
src/_uri.js:175:13
             continue;
         }
         if (_in.indexOf('../') === 0) {
-            inputBufferStart += 3;
+            inputBufferStart -= 3;
             continue;
         }

[Killed] ConditionalExpression
src/_uri.js:178:13
             inputBufferStart += 3;
             continue;
         }
-        if (_in.indexOf('/./') === 0) {
+        if (true) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:178:13
             inputBufferStart += 3;
             continue;
         }
-        if (_in.indexOf('/./') === 0) {
+        if (false) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ["./g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/b/c/./g"

[Timeout] AssignmentOperator
src/_uri.js:179:13
             continue;
         }
         if (_in.indexOf('/./') === 0) {
-            inputBufferStart += 2;
+            inputBufferStart -= 2;
             continue;
         }

[Killed] ConditionalExpression
src/_uri.js:182:13
             inputBufferStart += 2;
             continue;
         }
-        if (_in === '/.') {
+        if (false) {
             _in = '/';
             inputBufferStart += 2;
killedBy: resolve test: [".", "http://a/b/c/d;p?q", "http://a/b/c/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/"
Received: "http://a/b/c/."

[Killed] BlockStatement
src/_uri.js:182:27
             inputBufferStart += 2;
             continue;
         }
-        if (_in === '/.') {
-            _in = '/';
-            inputBufferStart += 2;
-        // force end of loop
-        }
+        if (_in === '/.') {}
         if (_in.indexOf('/../') === 0) {
             inputBufferStart += 3;
killedBy: resolve test: ['.', 'http://a/b/c/d;p?q', 'http://a/b/c/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/"
Received: "http://a/b/c/."

[Timeout] AssignmentOperator
src/_uri.js:184:13
         }
         if (_in === '/.') {
             _in = '/';
-            inputBufferStart += 2;
+            inputBufferStart -= 2;
         // force end of loop
         }

[Killed] ConditionalExpression
src/_uri.js:187:13
             inputBufferStart += 2;
         // force end of loop
         }
-        if (_in.indexOf('/../') === 0) {
+        if (false) {
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
killedBy: resolve test: ["../", "http://a/b/c/d;p?q", "http://a/b/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/../"

[Killed] EqualityOperator
src/_uri.js:187:13
             inputBufferStart += 2;
         // force end of loop
         }
-        if (_in.indexOf('/../') === 0) {
+        if (_in.indexOf('/../') !== 0) {
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Timeout] AssignmentOperator
src/_uri.js:188:13
         // force end of loop
         }
         if (_in.indexOf('/../') === 0) {
-            inputBufferStart += 3;
+            inputBufferStart -= 3;
             xi = output.lastIndexOf('/');
             if (xi !== -1 && xi !== output.length) {

[Killed] BlockStatement
src/_uri.js:190:52
         if (_in.indexOf('/../') === 0) {
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
-                output = output.substring(0, xi);
-            }
+            if (xi !== -1 && xi !== output.length) {}
             continue;
         }
killedBy: resolve test: ["../", "http://a/b/c/d;p?q", "http://a/b/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] EqualityOperator
src/_uri.js:190:30
         if (_in.indexOf('/../') === 0) {
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
+            if (xi !== -1 && xi === output.length) {
                 output = output.substring(0, xi);
             }
killedBy: resolve test: ['../', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] MethodExpression
src/_uri.js:191:26
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
             if (xi !== -1 && xi !== output.length) {
-                output = output.substring(0, xi);
+                output = output;
             }
             continue;
killedBy: resolve test: ["../", "http://a/b/c/d;p?q", "http://a/b/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] EqualityOperator
src/_uri.js:195:13
             }
             continue;
         }
-        if (_in === '/..') {
+        if (_in !== '/..') {
             _in = '/';
             inputBufferStart += 3;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:/"

[Killed] ConditionalExpression
src/_uri.js:195:13
             }
             continue;
         }
-        if (_in === '/..') {
+        if (false) {
             _in = '/';
             inputBufferStart += 3;
killedBy: resolve test: ['..', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/.."

[Timeout] AssignmentOperator
src/_uri.js:197:13
         }
         if (_in === '/..') {
             _in = '/';
-            inputBufferStart += 3;
+            inputBufferStart -= 3;
             xi = output.lastIndexOf('/');
             if (xi !== -1 && xi !== output.length) {

[Killed] ConditionalExpression
src/_uri.js:199:17
             _in = '/';
             inputBufferStart += 3;
             xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
+            if (false) {
                 output = output.substring(0, xi);
             }
killedBy: resolve test: ['..', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] ConditionalExpression
src/_uri.js:203:13
                 output = output.substring(0, xi);
             }
         }
-        if (_in === '.') {
+        if (false) {
             inputBufferStart += 1;
             continue;
killedBy: removeDotSegments test: [".", ""]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "."

[Killed] BlockStatement
src/_uri.js:203:26
                 output = output.substring(0, xi);
             }
         }
-        if (_in === '.') {
-            inputBufferStart += 1;
-            continue;
-        }
+        if (_in === '.') {}
         if (_in === '..') {
             inputBufferStart += 2;
killedBy: removeDotSegments test: [".", ""]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "."

[Timeout] AssignmentOperator
src/_uri.js:204:13
             }
         }
         if (_in === '.') {
-            inputBufferStart += 1;
+            inputBufferStart -= 1;
             continue;
         }

[Killed] ConditionalExpression
src/_uri.js:207:13
             inputBufferStart += 1;
             continue;
         }
-        if (_in === '..') {
+        if (true) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] BlockStatement
src/_uri.js:207:27
             inputBufferStart += 1;
             continue;
         }
-        if (_in === '..') {
-            inputBufferStart += 2;
-            continue;
-        }
+        if (_in === '..') {}
         let nextSlash = _in.indexOf('/', 1);
         if (nextSlash === -1) {
killedBy: removeDotSegments test: ["..", ""]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: ".."

[Timeout] AssignmentOperator
src/_uri.js:208:13
             continue;
         }
         if (_in === '..') {
-            inputBufferStart += 2;
+            inputBufferStart -= 2;
             continue;
         }

[Killed] ConditionalExpression
src/_uri.js:212:13
             continue;
         }
         let nextSlash = _in.indexOf('/', 1);
-        if (nextSlash === -1) {
+        if (true) {
             nextSlash = _in.length;
         }
killedBy: resolve test: ["./g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/b/c/./g"

[Timeout] EqualityOperator
src/_uri.js:212:13
             continue;
         }
         let nextSlash = _in.indexOf('/', 1);
-        if (nextSlash === -1) {
+        if (nextSlash !== -1) {
             nextSlash = _in.length;
         }

[Timeout] AssignmentOperator
src/_uri.js:215:9
         if (nextSlash === -1) {
             nextSlash = _in.length;
         }
-        inputBufferStart += nextSlash;
+        inputBufferStart -= nextSlash;
         output += (_in.substring(0, nextSlash));
     }

[Killed] AssignmentOperator
src/_uri.js:216:9
             nextSlash = _in.length;
         }
         inputBufferStart += nextSlash;
-        output += (_in.substring(0, nextSlash));
+        output -= _in.substring(0, nextSlash);
     }
     // 5.2.4 3
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:NaN"

[Killed] MethodExpression
src/_uri.js:216:20
             nextSlash = _in.length;
         }
         inputBufferStart += nextSlash;
-        output += (_in.substring(0, nextSlash));
+        output += (_in);
     }
     // 5.2.4 3
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/b/c/g/c/g/g/c/g/c/g/g/g/c/g/g/c/g/g/g/g/g"

[Killed] BlockStatement
src/_uri.js:224:47
 
 // 5.2.3.  Merge Paths
 
-function _merge({ authority, path }, refPath) { // object,string
-    if (authority != null && path === '') {
-        return `/${refPath}`;
-    }
-    const xi = path.lastIndexOf('/');
-    return (xi === -1) ? refPath : path.substring(0, xi + 1) + refPath;
-}
+function _merge({ authority, path }, refPath) {}
 
 // 5.2.2.  Transform References
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/_uri.js:225:30
 // 5.2.3.  Merge Paths
 
 function _merge({ authority, path }, refPath) { // object,string
-    if (authority != null && path === '') {
+    if (authority != null && path !== '') {
         return `/${refPath}`;
     }
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/g"

[Killed] ConditionalExpression
src/_uri.js:225:9
 // 5.2.3.  Merge Paths
 
 function _merge({ authority, path }, refPath) { // object,string
-    if (authority != null && path === '') {
+    if (true) {
         return `/${refPath}`;
     }
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/g"

[Killed] ArithmeticOperator
src/_uri.js:229:36
         return `/${refPath}`;
     }
     const xi = path.lastIndexOf('/');
-    return (xi === -1) ? refPath : path.substring(0, xi + 1) + refPath;
+    return (xi === -1) ? refPath : path.substring(0, xi + 1) - refPath;
 }
 
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a"

[Killed] ConditionalExpression
src/_uri.js:229:13
         return `/${refPath}`;
     }
     const xi = path.lastIndexOf('/');
-    return (xi === -1) ? refPath : path.substring(0, xi + 1) + refPath;
+    return (true) ? refPath : path.substring(0, xi + 1) + refPath;
 }
 
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://ag"

[Killed] BlockStatement
src/_uri.js:234:104
 
 // 5.2.2.  Transform References
 
-function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
-    if (scheme == null) {
-        scheme = base.scheme;
-        if (authority == null) {
-            ({ authority, userInfo, host, port } = base);
-            if (path === '') {
-                path = base.path;
-                query = query != null ? query : base.query;
-            } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
-            }
-        }
-    }
-    path && (path = removeDotSegments(path));
-    return { scheme, authority, userInfo, host, port, path, query, fragment };
-}
+function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {}
 
 // 5.2.1.  Pre-parse the Base URI
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: TypeError: Cannot destructure property 'scheme' of 'undefined' as it is undefined.

[Killed] ConditionalExpression
src/_uri.js:235:9
 // 5.2.2.  Transform References
 
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
-    if (scheme == null) {
+    if (true) {
         scheme = base.scheme;
         if (authority == null) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "http://a/b/c/h"

[Killed] ConditionalExpression
src/_uri.js:235:9
 // 5.2.2.  Transform References
 
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
-    if (scheme == null) {
+    if (false) {
         scheme = base.scheme;
         if (authority == null) {
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "g"

[Killed] ConditionalExpression
src/_uri.js:237:13
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
     if (scheme == null) {
         scheme = base.scheme;
-        if (authority == null) {
+        if (true) {
             ({ authority, userInfo, host, port } = base);
             if (path === '') {
killedBy: resolve test: ['//g', 'http://a/b/c/d;p?q', 'http://g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://g"
Received: "http://a/b/c/d;p?q"

[Killed] BlockStatement
src/_uri.js:237:32
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
     if (scheme == null) {
         scheme = base.scheme;
-        if (authority == null) {
-            ({ authority, userInfo, host, port } = base);
-            if (path === '') {
-                path = base.path;
-                query = query != null ? query : base.query;
-            } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
-            }
-        }
+        if (authority == null) {}
     }
     path && (path = removeDotSegments(path));
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http:g"

[Killed] BlockStatement
src/_uri.js:239:30
         scheme = base.scheme;
         if (authority == null) {
             ({ authority, userInfo, host, port } = base);
-            if (path === '') {
-                path = base.path;
-                query = query != null ? query : base.query;
-            } else {
+            if (path === '') {} else {
                 path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
             }
killedBy: resolve test: ['?y', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?y']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?y"
Received: "http://a?y"

[Killed] ConditionalExpression
src/_uri.js:239:17
         scheme = base.scheme;
         if (authority == null) {
             ({ authority, userInfo, host, port } = base);
-            if (path === '') {
+            if (true) {
                 path = base.path;
                 query = query != null ? query : base.query;
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://a/b/c/d;p?q"

[Killed] EqualityOperator
src/_uri.js:241:25
             ({ authority, userInfo, host, port } = base);
             if (path === '') {
                 path = base.path;
-                query = query != null ? query : base.query;
+                query = query == null ? query : base.query;
             } else {
                 path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
killedBy: resolve test: ['?y', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?y']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?y"
Received: "http://a/b/c/d;p?q"

[Killed] ConditionalExpression
src/_uri.js:241:25
             ({ authority, userInfo, host, port } = base);
             if (path === '') {
                 path = base.path;
-                query = query != null ? query : base.query;
+                query = true ? query : base.query;
             } else {
                 path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
killedBy: resolve test: ['#s', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?q#s']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?q#s"
Received: "http://a/b/c/d;p#s"

[Killed] BlockStatement
src/_uri.js:242:20
             if (path === '') {
                 path = base.path;
                 query = query != null ? query : base.query;
-            } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
-            }
+            } else {}
         }
     }
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://ag"

[Killed] MethodExpression
src/_uri.js:243:24
                 path = base.path;
                 query = query != null ? query : base.query;
             } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
+                path = path === '/' ? path : removeDotSegments(_merge(base, path));
             }
         }
killedBy: resolve test: ['/g', 'http://a/b/c/d;p?q', 'http://a/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/g"
Received: "http://a/b/c//g"

[Killed] EqualityOperator
src/_uri.js:243:24
                 path = base.path;
                 query = query != null ? query : base.query;
             } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
+                path = path.charAt(0) !== '/' ? path : removeDotSegments(_merge(base, path));
             }
         }
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://ag"

[Killed] LogicalOperator
src/_uri.js:247:5
             }
         }
     }
-    path && (path = removeDotSegments(path));
+    path || (path = removeDotSegments(path));
     return { scheme, authority, userInfo, host, port, path, query, fragment };
 }
killedBy: resolve test: ['/./g', 'http://a/b/c/d;p?q', 'http://a/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/g"
Received: "http://a/./g"

[Killed] ConditionalExpression
src/_uri.js:247:5
             }
         }
     }
-    path && (path = removeDotSegments(path));
+    true;
     return { scheme, authority, userInfo, host, port, path, query, fragment };
 }
killedBy: resolve test: ['/./g', 'http://a/b/c/d;p?q', 'http://a/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/g"
Received: "http://a/./g"

[Survived] BlockStatement
src/_uri.js:253:39
 
 // 5.2.1.  Pre-parse the Base URI
 
-function _preParseBaseUri({ scheme }) {
-    if (scheme == null) {
-        throw new Error('Violation 5.2.1, scheme component required');
-    }
-}
+function _preParseBaseUri({ scheme }) {}
 
 /**

[Killed] ConditionalExpression
src/_uri.js:254:9
 // 5.2.1.  Pre-parse the Base URI
 
 function _preParseBaseUri({ scheme }) {
-    if (scheme == null) {
+    if (true) {
         throw new Error('Violation 5.2.1, scheme component required');
     }
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: Violation 5.2.1, scheme component required

[Killed] EqualityOperator
src/_uri.js:254:9
 // 5.2.1.  Pre-parse the Base URI
 
 function _preParseBaseUri({ scheme }) {
-    if (scheme == null) {
+    if (scheme != null) {
         throw new Error('Violation 5.2.1, scheme component required');
     }
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: Violation 5.2.1, scheme component required

[Killed] BlockStatement
src/_uri.js:266:29
 * @memberof module:uri
 * @return {UriObj}
 */
-function resolve(base, ref) {
-    _preParseBaseUri(base);
-    return _transformReference(base, ref);
-}
+function resolve(base, ref) {}
 
 /**
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: TypeError: Cannot destructure property 'scheme' of 'undefined' as it is undefined.

[Killed] BlockStatement
src/_uri.js:277:38
 * @memberof module:uri
 * @returns {array} Path split to DECODED segments as array
 */
-function decodeSegments(encodedPath) {
-    if (encodedPath === '') {
-        return [];
-    }
-    const segments = encodedPath.split('/');
-    if (segments.shift() !== '') {
-        throw new Error('path-abempty expected');
-    }
-    return segments.map((segment) => decodeURIComponent(segment));
-}
+function decodeSegments(encodedPath) {}
 
 /**
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/_uri.js:278:9
 * @returns {array} Path split to DECODED segments as array
 */
 function decodeSegments(encodedPath) {
-    if (encodedPath === '') {
+    if (true) {
         return [];
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] EqualityOperator
src/_uri.js:278:9
 * @returns {array} Path split to DECODED segments as array
 */
 function decodeSegments(encodedPath) {
-    if (encodedPath === '') {
+    if (encodedPath !== '') {
         return [];
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/foo.bar"

[Killed] StringLiteral
src/_uri.js:281:40
     if (encodedPath === '') {
         return [];
     }
-    const segments = encodedPath.split('/');
+    const segments = encodedPath.split("");
     if (segments.shift() !== '') {
         throw new Error('path-abempty expected');
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: path-abempty expected

[Killed] ConditionalExpression
src/_uri.js:282:9
         return [];
     }
     const segments = encodedPath.split('/');
-    if (segments.shift() !== '') {
+    if (true) {
         throw new Error('path-abempty expected');
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: path-abempty expected

[Killed] BlockStatement
src/_uri.js:282:34
         return [];
     }
     const segments = encodedPath.split('/');
-    if (segments.shift() !== '') {
-        throw new Error('path-abempty expected');
-    }
+    if (segments.shift() !== '') {}
     return segments.map((segment) => decodeURIComponent(segment));
 }
killedBy: decodeSegments test 4 path-abempty expected
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ArrowFunction
src/_uri.js:285:25
     if (segments.shift() !== '') {
         throw new Error('path-abempty expected');
     }
-    return segments.map((segment) => decodeURIComponent(segment));
+    return segments.map(() => undefined);
 }
 
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: TypeError: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
src/_uri.js:295:35
 * @returns {string} path-abempty, ENCODED path, only characters specified in RFC3986_SEGMENT are encoded if [] specified
 * "" is returned
 */
-function encodeSegments(segments) {
-    if (!(segments instanceof Array)) {
-        throw new Error('IllegalArgumentException, array of segments expected');
-    }
-    if (segments.length === 0) {
-        return '';
-    }
-    return `/${segments.map((segment) => percentEncode(segment, RFC3986_SEGMENT)).join('/')}`;
-}
+function encodeSegments(segments) {}
 
 /**
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.skundefined"

[Killed] BooleanLiteral
src/_uri.js:296:9
 * "" is returned
 */
 function encodeSegments(segments) {
-    if (!(segments instanceof Array)) {
+    if (segments instanceof Array) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: IllegalArgumentException, array of segments expected

[Killed] ConditionalExpression
src/_uri.js:296:9
 * "" is returned
 */
 function encodeSegments(segments) {
-    if (!(segments instanceof Array)) {
+    if (true) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: IllegalArgumentException, array of segments expected

[Killed] EqualityOperator
src/_uri.js:299:9
     if (!(segments instanceof Array)) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
-    if (segments.length === 0) {
+    if (segments.length !== 0) {
         return '';
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk"
