[Killed] ConditionalExpression
src/_uri.js:299:9
     if (!(segments instanceof Array)) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
-    if (segments.length === 0) {
+    if (false) {
         return '';
     }
killedBy: encodeSegments tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "/"

[Killed] ArrowFunction
src/_uri.js:302:29
     if (segments.length === 0) {
         return '';
     }
-    return `/${segments.map((segment) => percentEncode(segment, RFC3986_SEGMENT)).join('/')}`;
+    return `/${segments.map(() => undefined).join('/')}`;
 }
 
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/"

[Killed] BlockStatement
src/_uri.js:313:51
 * @memberof module:uri
 * @returns {boolean}
 */
-function isSubordinate(uriParent, uriSub, orSame) {
-    // if subordinate is absolute and parent is not or parent has different authority
-    if (uriSub.authority != null && uriSub.authority !== uriParent.authority) {
-        return false;
-    }
-    const i = uriSub.path.indexOf(uriParent.path);
-    return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
-}
+function isSubordinate(uriParent, uriSub, orSame) {}
 function encodeSegment(segment) {
     return percentEncode(segment, RFC3986_SEGMENT);
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] ConditionalExpression
src/_uri.js:315:9
 */
 function isSubordinate(uriParent, uriSub, orSame) {
     // if subordinate is absolute and parent is not or parent has different authority
-    if (uriSub.authority != null && uriSub.authority !== uriParent.authority) {
+    if (true) {
         return false;
     }
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] ConditionalExpression
src/_uri.js:315:37
 */
 function isSubordinate(uriParent, uriSub, orSame) {
     // if subordinate is absolute and parent is not or parent has different authority
-    if (uriSub.authority != null && uriSub.authority !== uriParent.authority) {
+    if (uriSub.authority != null && true) {
         return false;
     }
killedBy: resolveAsSubordinate test: ["foo://username:password@my.example.com:8042/a/b?type=animal&name=narwhal#nose", "/a/b/c/d"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] BooleanLiteral
src/_uri.js:316:16
 function isSubordinate(uriParent, uriSub, orSame) {
     // if subordinate is absolute and parent is not or parent has different authority
     if (uriSub.authority != null && uriSub.authority !== uriParent.authority) {
-        return false;
+        return true;
     }
     const i = uriSub.path.indexOf(uriParent.path);
killedBy: Throws error if not subordinate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, not subordinate"

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:319:12
         return false;
     }
     const i = uriSub.path.indexOf(uriParent.path);
-    return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
+    return true && (orSame || uriSub.path.length !== uriParent.path.length);
 }
 function encodeSegment(segment) {
killedBy: Throws error if not subordinate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgument, not subordinate"

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:319:12
         return false;
     }
     const i = uriSub.path.indexOf(uriParent.path);
-    return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
+    return true;
 }
 function encodeSegment(segment) {
killedBy: isSubordinate test: ["/a/b/c", "/a/b/d", true, false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/_uri.js:321:33
     const i = uriSub.path.indexOf(uriParent.path);
     return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
 }
-function encodeSegment(segment) {
-    return percentEncode(segment, RFC3986_SEGMENT);
-}
+function encodeSegment(segment) {}
 
 function encodeQuery(str) {
killedBy: encode segment test: ["abcd", "abcd"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcd"
Received: undefined

[Killed] BlockStatement
src/_uri.js:325:27
     return percentEncode(segment, RFC3986_SEGMENT);
 }
 
-function encodeQuery(str) {
-    return percentEncode(str, RFC3986_QUERY);
-}
+function encodeQuery(str) {}
 
 function encodeRqlValue(str) {
killedBy: encode query test: ["abcd", "abcd"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcd"
Received: undefined

[Killed] BlockStatement
src/_uri.js:329:30
     return percentEncode(str, RFC3986_QUERY);
 }
 
-function encodeRqlValue(str) {
-    return percentEncode(str, RQL_VALUE);
-}
+function encodeRqlValue(str) {}
 
 function encodeFragment(str) {
killedBy: encode fragment test: ["ab?c", "ab?c"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab?c"
Received: undefined

[Killed] BlockStatement
src/_uri.js:333:30
     return percentEncode(str, RQL_VALUE);
 }
 
-function encodeFragment(str) {
-    return percentEncode(str, RFC3986_FRAGMENT);
-}
+function encodeFragment(str) {}
 
 /**
killedBy: encode fragment test: ["abcd", "abcd"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcd"
Received: undefined

[Killed] ConditionalExpression
src/_uri.js:348:9
 function checkEncoding(raw, legalRange, doThrow /* , flags*/) {
     // TODO: flags: ILLEGAL_PERCENT_ENCODING, SUPERFLUOUS_ASCII_PERCENT_ENCODING
     // TODO: flags: PERCENT_ENCODING_SHOULD_BE_UPPERCASE, SUPERFLUOUS_NON_ASCII_PERCENT_ENCODING
-    if (!raw) {
+    if (true) {
         return null;
     }
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:348:15
 function checkEncoding(raw, legalRange, doThrow /* , flags*/) {
     // TODO: flags: ILLEGAL_PERCENT_ENCODING, SUPERFLUOUS_ASCII_PERCENT_ENCODING
     // TODO: flags: PERCENT_ENCODING_SHOULD_BE_UPPERCASE, SUPERFLUOUS_NON_ASCII_PERCENT_ENCODING
-    if (!raw) {
-        return null;
-    }
+    if (!raw) {}
     const reLegal = new RegExp(`[${legalRange}]`);
     const tokens = raw.match(PCHAR_TOKENIZER);
killedBy: basic setters test setFragment test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/there/
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
src/_uri.js:353:21
     }
     const reLegal = new RegExp(`[${legalRange}]`);
     const tokens = raw.match(PCHAR_TOKENIZER);
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i >= tokens.length; i++) {
         const t = tokens[i];
         if (t.length > 1) {
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] EqualityOperator
src/_uri.js:353:21
     }
     const reLegal = new RegExp(`[${legalRange}]`);
     const tokens = raw.match(PCHAR_TOKENIZER);
-    for (let i = 0; i < tokens.length; i++) {
+    for (let i = 0; i <= tokens.length; i++) {
         const t = tokens[i];
         if (t.length > 1) {
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b/c"], "foo://username:password@my.example.com:8042/a/b/c?typ
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/_uri.js:355:13
     const tokens = raw.match(PCHAR_TOKENIZER);
     for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
-        if (t.length > 1) {
+        if (t.length <= 1) {
             try {
                 decodeURIComponent(t);
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:355:27
     const tokens = raw.match(PCHAR_TOKENIZER);
     for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
-        if (t.length > 1) {
-            try {
-                decodeURIComponent(t);
-            } catch (ex) {
-                const e = new Error(`Illegal PCHAR sequence:${t}`);
-                if (doThrow) {
-                    throw e;
-                }
-                return e;
-            }
-        } else if (!t.match(reLegal)) {
+        if (t.length > 1) {} else if (!t.match(reLegal)) {
             const e = new Error(`Illegal PCHAR sequence:${t}`);
             if (doThrow) {
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%FF%FF/c"
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:%FF%FF"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:356:17
     for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
         if (t.length > 1) {
-            try {
-                decodeURIComponent(t);
-            } catch (ex) {
+            try {} catch (ex) {
                 const e = new Error(`Illegal PCHAR sequence:${t}`);
                 if (doThrow) {
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%FF%FF/c"
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:%FF%FF"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:358:26
         if (t.length > 1) {
             try {
                 decodeURIComponent(t);
-            } catch (ex) {
-                const e = new Error(`Illegal PCHAR sequence:${t}`);
-                if (doThrow) {
-                    throw e;
-                }
-                return e;
-            }
+            } catch (ex) {}
         } else if (!t.match(reLegal)) {
             const e = new Error(`Illegal PCHAR sequence:${t}`);
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%FF%FF/c"
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:%FF%FF"

Received function did not throw

[Killed] StringLiteral
src/_uri.js:359:37
             try {
                 decodeURIComponent(t);
             } catch (ex) {
-                const e = new Error(`Illegal PCHAR sequence:${t}`);
+                const e = new Error(``);
                 if (doThrow) {
                     throw e;
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%FF%FF/c"
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:%FF%FF"
Received message:   ""

      702 |               } else {
      703 |                 stryCov_9fa48("350");
    > 704 |                 const e = new Error(stryMutAct_9fa48("351") ? `` : (stryCov_9fa48("351"), `Illegal PCHAR sequence:${t}`));

[Killed] BlockStatement
src/_uri.js:360:30
                 decodeURIComponent(t);
             } catch (ex) {
                 const e = new Error(`Illegal PCHAR sequence:${t}`);
-                if (doThrow) {
-                    throw e;
-                }
+                if (doThrow) {}
                 return e;
             }
killedBy: checkSegmentEncoding test: ["%99", false]
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:360:21
                 decodeURIComponent(t);
             } catch (ex) {
                 const e = new Error(`Illegal PCHAR sequence:${t}`);
-                if (doThrow) {
+                if (false) {
                     throw e;
                 }
killedBy: checkSegmentEncoding test: ["%99", false]
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/_uri.js:365:39
                 }
                 return e;
             }
-        } else if (!t.match(reLegal)) {
-            const e = new Error(`Illegal PCHAR sequence:${t}`);
-            if (doThrow) {
-                throw e;
-            }
-            return e;
-        }
+        } else if (!t.match(reLegal)) {}
     }
     return null;
killedBy: checkSegmentEncoding test: ["a/b", false]
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
src/_uri.js:365:20
                 }
                 return e;
             }
-        } else if (!t.match(reLegal)) {
+        } else if (t.match(reLegal)) {
             const e = new Error(`Illegal PCHAR sequence:${t}`);
             if (doThrow) {
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b/c"], "foo://username:password@my.example.com:8042/a/b/c?typ
statusReason: Error: Illegal PCHAR sequence:/

[Killed] ConditionalExpression
src/_uri.js:367:17
             }
         } else if (!t.match(reLegal)) {
             const e = new Error(`Illegal PCHAR sequence:${t}`);
-            if (doThrow) {
+            if (true) {
                 throw e;
             }
killedBy: checkSegmentEncoding test: ["a/b", false]
statusReason: Error: Illegal PCHAR sequence:/

[Killed] BlockStatement
src/_uri.js:376:46
     return null;
 }
 
-function checkSegmentsEncoding(str, doThrow) {
-    return checkEncoding(str, RFC3986_PATH_SEGMENTS, doThrow);
-}
+function checkSegmentsEncoding(str, doThrow) {}
 
 function checkSegmentEncoding(str, doThrow) {
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:380:45
     return checkEncoding(str, RFC3986_PATH_SEGMENTS, doThrow);
 }
 
-function checkSegmentEncoding(str, doThrow) {
-    return checkEncoding(str, RFC3986_SEGMENT, doThrow);
-}
+function checkSegmentEncoding(str, doThrow) {}
 
 function checkQueryEncoding(str, doThrow) {
killedBy: checkSegmentEncoding should allow uppercase characters
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/_uri.js:384:43
     return checkEncoding(str, RFC3986_SEGMENT, doThrow);
 }
 
-function checkQueryEncoding(str, doThrow) {
-    return checkEncoding(str, RFC3986_QUERY, doThrow);
-}
+function checkQueryEncoding(str, doThrow) {}
 
 function checkFragmentEncoding(str, doThrow) {
killedBy: checkQueryEncoding test: ["", true]
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/_uri.js:388:46
     return checkEncoding(str, RFC3986_QUERY, doThrow);
 }
 
-function checkFragmentEncoding(str, doThrow) {
-    return checkEncoding(str, RFC3986_FRAGMENT, doThrow);
-}
+function checkFragmentEncoding(str, doThrow) {}
 
 /**
killedBy: checkFragmentEncoding test: ["", true]
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/_uri.js:400:37
 * @memberof module:uri
 * @returns {any}
 */
-function parseQuery(query, bDecode) {
-    // returns:	Object
-    if (query == null) { return null; }
-    if (query === '') { return {}; }
-
-    return query.split('&').reduce((obj, part) => {
-        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
-        const currVal = obj[name];
-        return {
-            ...obj,
-            [name]: currVal == null ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
-        };
-    }, {});
-}
+function parseQuery(query, bDecode) {}
 
 module.exports = {
killedBy: parseQuery test empty string expected using true 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[Killed] BlockStatement
src/_uri.js:402:24
 */
 function parseQuery(query, bDecode) {
     // returns:	Object
-    if (query == null) { return null; }
+    if (query == null) {}
     if (query === '') { return {}; }
 
killedBy: parseQuery test null string expected using true
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] ConditionalExpression
src/_uri.js:402:9
 */
 function parseQuery(query, bDecode) {
     // returns:	Object
-    if (query == null) { return null; }
+    if (false) { return null; }
     if (query === '') { return {}; }
 
killedBy: parseQuery test null string expected using true
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] ConditionalExpression
src/_uri.js:403:9
 function parseQuery(query, bDecode) {
     // returns:	Object
     if (query == null) { return null; }
-    if (query === '') { return {}; }
+    if (true) { return {}; }
 
     return query.split('&').reduce((obj, part) => {
killedBy: equalsQueryStrData test: ['w=42&t=3', 'w=42&t=4', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/_uri.js:403:9
 function parseQuery(query, bDecode) {
     // returns:	Object
     if (query == null) { return null; }
-    if (query === '') { return {}; }
+    if (query !== '') { return {}; }
 
     return query.split('&').reduce((obj, part) => {
killedBy: parseQuery test string query expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "x": Array [
-     "10",

[Killed] BlockStatement
src/_uri.js:405:51
     if (query == null) { return null; }
     if (query === '') { return {}; }
 
-    return query.split('&').reduce((obj, part) => {
-        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
-        const currVal = obj[name];
-        return {
-            ...obj,
-            [name]: currVal == null ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
-        };
-    }, {});
+    return query.split('&').reduce((obj, part) => {}, {});
 }
 
killedBy: equalsQueryStrData test: ['w=42&t=3', 'w=42&t=4', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/_uri.js:406:82
     if (query === '') { return {}; }
 
     return query.split('&').reduce((obj, part) => {
-        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
+        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : () => undefined);
         const currVal = obj[name];
         return {
killedBy: equalsQueryStrData test: ['w=42&t=3', 'w=42&t=4', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/_uri.js:406:42
     if (query === '') { return {}; }
 
     return query.split('&').reduce((obj, part) => {
-        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
+        const [ name, val ] = part.split("").map(bDecode ? decodeURIComponent : (p) => p);
         const currVal = obj[name];
         return {
killedBy: equalsQueryStrData test: ['w=42&t=3', 'w=42&t=4', false]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/_uri.js:410:21
         const currVal = obj[name];
         return {
             ...obj,
-            [name]: currVal == null ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
+            [name]: false ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
         };
     }, {});
killedBy: basic getters test getQuery test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", true], {"name": "narwhal", "type": "animal"}]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 8

  Object {
-   "name": "narwhal",
-   "type": "animal",

[Killed] ConditionalExpression
src/_uri.js:410:21
         const currVal = obj[name];
         return {
             ...obj,
-            [name]: currVal == null ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
+            [name]: true ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
         };
     }, {});
killedBy: parseQuery test string query expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
-   "x": Array [
-     "10",
