[Killed] StringLiteral
src/builder.js:7:21
 
 const uri = require('../src/_uri');
 
-const PLACEHOLDER = '$$$'; // should be safe string, not occuring in url templates, and not breaking decomposition
+const PLACEHOLDER = ""; // should be safe string, not occuring in url templates, and not breaking decomposition
 const REPLACE = /\$\$\$/g;
 
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: "//"

[Killed] BlockStatement
src/builder.js:15:24
     // new Class to be able to make instanceOf
     // needed by encode function to know if encode or not
 
-    constructor(value) {
-        this.string = `${value}`; // template to get string from value
-    }
+    constructor(value) {}
 }
 
killedBy: uri builder test query param can be already encoded elsewhere, use raw
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/path/?a=a&b=b#"
Received: "/path/?undefined"

[Killed] StringLiteral
src/builder.js:16:23
     // needed by encode function to know if encode or not
 
     constructor(value) {
-        this.string = `${value}`; // template to get string from value
+        this.string = ``; // template to get string from value
     }
 }
killedBy: uri builder test query param can be already encoded elsewhere, use raw
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/path/?a=a&b=b#"
Received: "/path/?"

[Killed] ArrayDeclaration
src/builder.js:20:18
     }
 }
 
-const ENCODERS = [ // order is important!
-    [ 'path', uri.encodeSegment ],
-    [ 'query', uri.encodeQuery ],
-    [ 'fragment', uri.encodeFragment ]
-];
+const ENCODERS = [];
 
 function encode(value, encoder) {
killedBy: uri builder test only path parameter
statusReason: Error: Params outside  are unsupported

[Killed] StringLiteral
src/builder.js:21:7
 }
 
 const ENCODERS = [ // order is important!
-    [ 'path', uri.encodeSegment ],
+    [ "", uri.encodeSegment ],
     [ 'query', uri.encodeQuery ],
     [ 'fragment', uri.encodeFragment ]
killedBy: uri builder test only path parameter
statusReason: Error: Params outside /query/fragment are unsupported

[Killed] ArrayDeclaration
src/builder.js:23:5
 const ENCODERS = [ // order is important!
     [ 'path', uri.encodeSegment ],
     [ 'query', uri.encodeQuery ],
-    [ 'fragment', uri.encodeFragment ]
+    []
 ];
 
killedBy: uri builder test path query and fragment use DIFFERENT ENCODERS
statusReason: Error: Params outside path/query/ are unsupported

[Killed] BlockStatement
src/builder.js:26:33
     [ 'fragment', uri.encodeFragment ]
 ];
 
-function encode(value, encoder) {
-    return value instanceof EncodedString ? value.string : encoder(`${value}`); // template to get string from value
-}
+function encode(value, encoder) {}
 
 function build(encoders, strings, ...values) {
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: "/undefined/"

[Killed] BlockStatement
src/builder.js:30:46
     return value instanceof EncodedString ? value.string : encoder(`${value}`); // template to get string from value
 }
 
-function build(encoders, strings, ...values) {
-    const uriTemplate = strings.reduce((last, actual) => `${last}${PLACEHOLDER}${actual}`);
-
-    const decomposed = uri.decomposeComponents(uriTemplate);
-
-    encoders.forEach(([ key, encoder ]) => {
-        const value = decomposed[key];
-        if (!value) { return; }
-        decomposed[key] = value.replace(REPLACE, () => encode(values.shift(), encoder));
-    });
-
-    const recomposed = uri.recomposeComponents(decomposed);
-
-    if (REPLACE.test(recomposed)) {
-        throw new Error(`Params outside ${encoders.map(([ key ]) => key).join('/')} are unsupported`);
-    }
-    return recomposed;
-}
+function build(encoders, strings, ...values) {}
 
 /**
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: undefined

[Killed] ArrowFunction
src/builder.js:31:40
 }
 
 function build(encoders, strings, ...values) {
-    const uriTemplate = strings.reduce((last, actual) => `${last}${PLACEHOLDER}${actual}`);
+    const uriTemplate = strings.reduce(() => undefined);
 
     const decomposed = uri.decomposeComponents(uriTemplate);
killedBy: uri builder test only path parameter
statusReason: TypeError: Cannot read properties of undefined (reading 'match')

[Killed] BlockStatement
src/builder.js:35:44
 
     const decomposed = uri.decomposeComponents(uriTemplate);
 
-    encoders.forEach(([ key, encoder ]) => {
-        const value = decomposed[key];
-        if (!value) { return; }
-        decomposed[key] = value.replace(REPLACE, () => encode(values.shift(), encoder));
-    });
+    encoders.forEach(([ key, encoder ]) => {});
 
     const recomposed = uri.recomposeComponents(decomposed);
killedBy: uri builder test only path parameter
statusReason: Error: Params outside path/query/fragment are unsupported

[Killed] BlockStatement
src/builder.js:37:21
 
     encoders.forEach(([ key, encoder ]) => {
         const value = decomposed[key];
-        if (!value) { return; }
+        if (!value) {}
         decomposed[key] = value.replace(REPLACE, () => encode(values.shift(), encoder));
     });
killedBy: uri builder test only path parameter
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/builder.js:37:13
 
     encoders.forEach(([ key, encoder ]) => {
         const value = decomposed[key];
-        if (!value) { return; }
+        if (true) { return; }
         decomposed[key] = value.replace(REPLACE, () => encode(values.shift(), encoder));
     });
killedBy: uri builder test only path parameter
statusReason: Error: Params outside path/query/fragment are unsupported

[Killed] ArrowFunction
src/builder.js:38:50
     encoders.forEach(([ key, encoder ]) => {
         const value = decomposed[key];
         if (!value) { return; }
-        decomposed[key] = value.replace(REPLACE, () => encode(values.shift(), encoder));
+        decomposed[key] = value.replace(REPLACE, () => undefined);
     });
 
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: "/undefined/"

[Killed] BlockStatement
src/builder.js:43:35
 
     const recomposed = uri.recomposeComponents(decomposed);
 
-    if (REPLACE.test(recomposed)) {
-        throw new Error(`Params outside ${encoders.map(([ key ]) => key).join('/')} are unsupported`);
-    }
+    if (REPLACE.test(recomposed)) {}
     return recomposed;
 }
killedBy: uri builder test params outside path/query/fragment should throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Params outside path/query/fragment are unsupported"

Received function did not throw

[Killed] ConditionalExpression
src/builder.js:43:9
 
     const recomposed = uri.recomposeComponents(decomposed);
 
-    if (REPLACE.test(recomposed)) {
+    if (true) {
         throw new Error(`Params outside ${encoders.map(([ key ]) => key).join('/')} are unsupported`);
     }
killedBy: uri builder test only path parameter
statusReason: Error: Params outside path/query/fragment are unsupported

[Killed] ArrowFunction
src/builder.js:44:56
     const recomposed = uri.recomposeComponents(decomposed);
 
     if (REPLACE.test(recomposed)) {
-        throw new Error(`Params outside ${encoders.map(([ key ]) => key).join('/')} are unsupported`);
+        throw new Error(`Params outside ${encoders.map(() => undefined).join('/')} are unsupported`);
     }
     return recomposed;
killedBy: uri builder test params outside path/query/fragment should throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Params outside path/query/fragment are unsupported"
Received message:   "Params outside // are unsupported"

      106 |       } else {
      107 |         stryCov_9fa48("410");
    > 108 |         throw new Error(stryMutAct_9fa48("411") ? `` : (stryCov_9fa48("411"), `Params outside ${encoders.map(stryMutAct_9fa48("412") ? () => undef

[Killed] StringLiteral
src/builder.js:44:79
     const recomposed = uri.recomposeComponents(decomposed);
 
     if (REPLACE.test(recomposed)) {
-        throw new Error(`Params outside ${encoders.map(([ key ]) => key).join('/')} are unsupported`);
+        throw new Error(`Params outside ${encoders.map(([ key ]) => key).join("")} are unsupported`);
     }
     return recomposed;
killedBy: uri builder test params outside path/query/fragment should throw
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Params outside path/query/fragment are unsupported"
Received message:   "Params outside pathqueryfragment are unsupported"

      106 |       } else {
      107 |         stryCov_9fa48("410");
    > 108 |         throw new Error(stryMutAct_9fa48("411") ? `` : (stryCov_9fa48("411"), `Params outside ${encoders.map(stryMutAct_9fa48("412"

[Killed] BlockStatement
src/builder.js:61:41
  * // RESULT: /foo/a%2Fb%3Fc/bar/?x=a%23b#/baz/a%20b
  *
  */
-function uriBuilder(strings, ...values) {
-    return build(ENCODERS, strings, ...values);
-}
+function uriBuilder(strings, ...values) {}
 
 /**
killedBy: uri builder test only path parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/10/"
Received: undefined

[Killed] BlockStatement
src/builder.js:82:44
  * // RESULT: /foo/10/bar/?eq(x,a%29b)'
  *
  */
-function uriBuilderRql(strings, ...values) {
-    const encoders = [
-        ENCODERS[0], // 'path',
-        [ 'query', uri.encodeRqlValue ],
-        ENCODERS[2]  // 'fragment'
-    ]
-    return build(encoders, strings, ...values);
-}
+function uriBuilderRql(strings, ...values) {}
 
 /**
killedBy: uri builder test RQL query control chars are correctly ENCODED using uriBuilderRql
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/foo/?eq(encoded,%3D%3E%3C%21%2C%3A%26%7C%2F%28%29)"
Received: undefined

[Killed] ArrayDeclaration
src/builder.js:83:22
  *
  */
 function uriBuilderRql(strings, ...values) {
-    const encoders = [
-        ENCODERS[0], // 'path',
-        [ 'query', uri.encodeRqlValue ],
-        ENCODERS[2]  // 'fragment'
-    ]
+    const encoders = []
     return build(encoders, strings, ...values);
 }
killedBy: uri builder test RQL query control chars are correctly ENCODED using uriBuilderRql
statusReason: Error: Params outside  are unsupported

[Killed] StringLiteral
src/builder.js:85:11
 function uriBuilderRql(strings, ...values) {
     const encoders = [
         ENCODERS[0], // 'path',
-        [ 'query', uri.encodeRqlValue ],
+        [ "", uri.encodeRqlValue ],
         ENCODERS[2]  // 'fragment'
     ]
killedBy: uri builder test RQL query control chars are correctly ENCODED using uriBuilderRql
statusReason: Error: Params outside path//fragment are unsupported

[Killed] BlockStatement
src/builder.js:107:22
  * uriBuilder`/foo/${p1}/bar/?${raw(query)}`
  * // RESULT: /foo/a%2Fb%3Fc/bar/?name=John%20Doe&age=20
  */
-function raw(string) {
-    return new EncodedString(string);
-}
+function raw(string) {}
 
 module.exports = {
killedBy: uri builder test query param can be already encoded elsewhere, use raw
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/path/?a=a&b=b#"
Received: "/path/?undefined"
