[Killed] BlockStatement
src/_uri.js:104:68
     return result;
 }
 
-function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    if (authority == null) {
-        // If authority is null, all sub-parts must also be null.
-        if (userInfo != null || host != null || port != null) {
-            throw new Error('IllegalStateException,AuthorityInvariant broken');
-        }
-        return; // This is a valid state (all null)
-    }
-
-    // If authority is not null, it must match the recomposed parts.
-    // recomposeAuthorityComponents will throw if host is null, which correctly indicates a broken invariant.
-    if (authority !== recomposeAuthorityComponents(userInfo, host, port)) {
-        throw new Error('IllegalStateException,AuthorityInvariant broken');
-    }
-}
+function _checkAuthorityInvariant(authority, userInfo, host, port) {}
 
 /**
killedBy: checkAuthorityInvariant should throw in recompose on invalid input
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/_uri.js:105:9
 }
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    if (authority == null) {
+    if (authority != null) {
         // If authority is null, all sub-parts must also be null.
         if (userInfo != null || host != null || port != null) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: Illegal host:undefined

[Killed] ConditionalExpression
src/_uri.js:105:9
 }
 
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
-    if (authority == null) {
+    if (false) {
         // If authority is null, all sub-parts must also be null.
         if (userInfo != null || host != null || port != null) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: Illegal host:undefined

[Killed] EqualityOperator
src/_uri.js:107:13
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     if (authority == null) {
         // If authority is null, all sub-parts must also be null.
-        if (userInfo != null || host != null || port != null) {
+        if (userInfo == null || host != null || port != null) {
             throw new Error('IllegalStateException,AuthorityInvariant broken');
         }
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] LogicalOperator
src/_uri.js:107:13
 function _checkAuthorityInvariant(authority, userInfo, host, port) {
     if (authority == null) {
         // If authority is null, all sub-parts must also be null.
-        if (userInfo != null || host != null || port != null) {
+        if ((userInfo != null || host != null) && port != null) {
             throw new Error('IllegalStateException,AuthorityInvariant broken');
         }
killedBy: checkAuthorityInvariant should throw when authority is null but sub-components are not
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalStateException,AuthorityInvariant broken"

Received function did not throw

[Killed] EqualityOperator
src/_uri.js:115:9
 
     // If authority is not null, it must match the recomposed parts.
     // recomposeAuthorityComponents will throw if host is null, which correctly indicates a broken invariant.
-    if (authority !== recomposeAuthorityComponents(userInfo, host, port)) {
+    if (authority === recomposeAuthorityComponents(userInfo, host, port)) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
     }
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:115:9
 
     // If authority is not null, it must match the recomposed parts.
     // recomposeAuthorityComponents will throw if host is null, which correctly indicates a broken invariant.
-    if (authority !== recomposeAuthorityComponents(userInfo, host, port)) {
+    if (true) {
         throw new Error('IllegalStateException,AuthorityInvariant broken');
     }
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: IllegalStateException,AuthorityInvariant broken

[Killed] ConditionalExpression
src/_uri.js:134:15
     _checkAuthorityInvariant(authority, userInfo, host, port);
 
     let result = '';
-    result += scheme != null ? `${scheme}:` : '';
+    result += false ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "h"

[Killed] AssignmentOperator
src/_uri.js:137:5
     result += scheme != null ? `${scheme}:` : '';
     result += authority != null ? `//${authority}` : '';
     result += path;
-    result += query != null ? `?${query}` : '';
+    result -= query != null ? `?${query}` : '';
     result += fragment != null ? `#${fragment}` : '';
 
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "NaN"

[Killed] AssignmentOperator
src/_uri.js:138:5
     result += authority != null ? `//${authority}` : '';
     result += path;
     result += query != null ? `?${query}` : '';
-    result += fragment != null ? `#${fragment}` : '';
+    result -= fragment != null ? `#${fragment}` : '';
 
     return result;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: NaN

[Killed] LogicalOperator
src/_uri.js:152:21
 */
 function percentEncode(str, legalRange) {
     const retVal = Array.from(str);
-    const reLegal = legalRange && new RegExp(`[${legalRange}]`);
+    const reLegal = legalRange || new RegExp(`[${legalRange}]`);
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: SyntaxError: Invalid regular expression: /0-9a-zA-Z-._~!$&'()*+,;=:@/: Nothing to repeat

[Killed] ConditionalExpression
src/_uri.js:154:13
     const retVal = Array.from(str);
     const reLegal = legalRange && new RegExp(`[${legalRange}]`);
     function encode(cp, i, buff) {
-        if (reLegal && cp.match(reLegal)) { return; }
+        if (true) { return; }
         let enc = encodeURIComponent(cp);
         if (enc.length === 1) {
killedBy: percentEncode test: ["/+", "+/?", "+/%3F"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+/%3F"
Received: "+/?"

[Killed] BlockStatement
src/_uri.js:156:31
     function encode(cp, i, buff) {
         if (reLegal && cp.match(reLegal)) { return; }
         let enc = encodeURIComponent(cp);
-        if (enc.length === 1) {
-            enc = `%${cp.charCodeAt(0).toString(16).toUpperCase()}`;
-        }
+        if (enc.length === 1) {}
         buff[i] = enc;
     }
killedBy: percentEncode test: ["abc", "mama", "%6Da%6Da"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "%6Da%6Da"
Received: "mama"

[Killed] StringLiteral
src/_uri.js:162:24
         buff[i] = enc;
     }
     retVal.forEach(encode);
-    return retVal.join('');
+    return retVal.join("Stryker was here!");
 }
 
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk/fStryker was here!oStryker was here!o"

[Killed] ConditionalExpression
src/_uri.js:175:12
     let inputBufferStart = 0;
     const inputBufferEnd = path.length;
     let output = '';
-    while (inputBufferStart < inputBufferEnd) {
+    while (false) {
         let _in = path.substring(inputBufferStart);
         if (_in.indexOf('./') === 0) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] EqualityOperator
src/_uri.js:175:12
     let inputBufferStart = 0;
     const inputBufferEnd = path.length;
     let output = '';
-    while (inputBufferStart < inputBufferEnd) {
+    while (inputBufferStart >= inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
         if (_in.indexOf('./') === 0) {
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:177:13
     let output = '';
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
-        if (_in.indexOf('./') === 0) {
+        if (true) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] EqualityOperator
src/_uri.js:177:13
     let output = '';
     while (inputBufferStart < inputBufferEnd) {
         let _in = path.substring(inputBufferStart);
-        if (_in.indexOf('./') === 0) {
+        if (_in.indexOf('./') !== 0) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] EqualityOperator
src/_uri.js:185:13
             inputBufferStart += 3;
             continue;
         }
-        if (_in.indexOf('/./') === 0) {
+        if (_in.indexOf('/./') !== 0) {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:194:13
             inputBufferStart += 2;
         // force end of loop
         }
-        if (_in.indexOf('/../') === 0) {
+        if (true) {
             inputBufferStart += 3;
             const xi = output.lastIndexOf('/');
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] BlockStatement
src/_uri.js:194:40
             inputBufferStart += 2;
         // force end of loop
         }
-        if (_in.indexOf('/../') === 0) {
-            inputBufferStart += 3;
-            const xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
-                output = output.substring(0, xi);
-            }
-            continue;
-        }
+        if (_in.indexOf('/../') === 0) {}
         if (_in === '/..') {
             _in = '/';
killedBy: resolve test: ['../', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/../"

[Killed] EqualityOperator
src/_uri.js:197:30
         if (_in.indexOf('/../') === 0) {
             inputBufferStart += 3;
             const xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
+            if (xi !== -1 && xi === output.length) {
                 output = output.substring(0, xi);
             }
killedBy: resolve test: ['../', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] BlockStatement
src/_uri.js:197:52
         if (_in.indexOf('/../') === 0) {
             inputBufferStart += 3;
             const xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
-                output = output.substring(0, xi);
-            }
+            if (xi !== -1 && xi !== output.length) {}
             continue;
         }
killedBy: resolve test: ['../', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] StringLiteral
src/_uri.js:203:19
             continue;
         }
         if (_in === '/..') {
-            _in = '/';
+            _in = "";
             inputBufferStart += 3;
             const xi = output.lastIndexOf('/');
killedBy: resolve test: ['..', 'http://a/b/c/d;p?q', 'http://a/b/']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b"

[Killed] ConditionalExpression
src/_uri.js:206:17
             _in = '/';
             inputBufferStart += 3;
             const xi = output.lastIndexOf('/');
-            if (xi !== -1 && xi !== output.length) {
+            if (false) {
                 output = output.substring(0, xi);
             }
killedBy: resolve test: ["..", "http://a/b/c/d;p?q", "http://a/b/"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/"
Received: "http://a/b/c/"

[Killed] EqualityOperator
src/_uri.js:210:13
                 output = output.substring(0, xi);
             }
         }
-        if (_in === '.') {
+        if (_in !== '.') {
             inputBufferStart += 1;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:210:13
                 output = output.substring(0, xi);
             }
         }
-        if (_in === '.') {
+        if (true) {
             inputBufferStart += 1;
             continue;
killedBy: resolve test: ['g:h', 'http://a/b/c/d;p?q', 'g:h']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Killed] ConditionalExpression
src/_uri.js:214:13
             inputBufferStart += 1;
             continue;
         }
-        if (_in === '..') {
+        if (false) {
             inputBufferStart += 2;
             continue;
killedBy: removeDotSegments test: ["..", ""]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: ".."

[Killed] EqualityOperator
src/_uri.js:214:13
             inputBufferStart += 1;
             continue;
         }
-        if (_in === '..') {
+        if (_in !== '..') {
             inputBufferStart += 2;
             continue;
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "g:"

[Timeout] BlockStatement
src/_uri.js:219:31
             continue;
         }
         let nextSlash = _in.indexOf('/', 1);
-        if (nextSlash === -1) {
-            nextSlash = _in.length;
-        }
+        if (nextSlash === -1) {}
         inputBufferStart += nextSlash;
         output += (_in.substring(0, nextSlash));

[Killed] BlockStatement
src/_uri.js:232:43
 // 5.2.3.  Merge Paths
 
 function _merge({ authority, path }, refPath) { // object,string
-    if (authority != null && path === '') {
-        return `/${refPath}`;
-    }
+    if (authority != null && path === '') {}
     const xi = path.lastIndexOf('/');
     return (xi === -1) ? refPath : path.substring(0, xi + 1) + refPath;
killedBy: resolve test: ["./../g", "http://john.doe@www.example.com:123", "http://john.doe@www.example.com:123/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://john.doe@www.example.com:123/g"
Received: "http://john.doe@www.example.com:123g"

[Killed] ConditionalExpression
src/_uri.js:232:9
 // 5.2.3.  Merge Paths
 
 function _merge({ authority, path }, refPath) { // object,string
-    if (authority != null && path === '') {
+    if (true && path === '') {
         return `/${refPath}`;
     }
killedBy: resolve test: ["./../^g*", "http:", "http:^g*"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http:^g*"
Received: "http:/^g*"

[Killed] BlockStatement
src/_uri.js:242:25
 // 5.2.2.  Transform References
 
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
-    if (scheme == null) {
-        scheme = base.scheme;
-        if (authority == null) {
-            ({ authority, userInfo, host, port } = base);
-            if (path === '') {
-                path = base.path;
-                query = query != null ? query : base.query;
-            } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
-            }
-        }
-    }
+    if (scheme == null) {}
     path && (path = removeDotSegments(path));
     return { scheme, authority, userInfo, host, port, path, query, fragment };
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "g"

[Killed] ConditionalExpression
src/_uri.js:244:13
 function _transformReference(base, { scheme, authority, userInfo, host, port, path, query, fragment }) {
     if (scheme == null) {
         scheme = base.scheme;
-        if (authority == null) {
+        if (false) {
             ({ authority, userInfo, host, port } = base);
             if (path === '') {
killedBy: resolve test: ["g", "http://a/b/c/d;p?q", "http://a/b/c/g"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http:g"

[Killed] ConditionalExpression
src/_uri.js:246:17
         scheme = base.scheme;
         if (authority == null) {
             ({ authority, userInfo, host, port } = base);
-            if (path === '') {
+            if (false) {
                 path = base.path;
                 query = query != null ? query : base.query;
killedBy: resolve test: ['?y', 'http://a/b/c/d;p?q', 'http://a/b/c/d;p?y']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?y"
Received: "http://a/b/c/?y"

[Killed] ConditionalExpression
src/_uri.js:248:25
             ({ authority, userInfo, host, port } = base);
             if (path === '') {
                 path = base.path;
-                query = query != null ? query : base.query;
+                query = false ? query : base.query;
             } else {
                 path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
killedBy: resolve test: ["?y", "http://a/b/c/d;p?q", "http://a/b/c/d;p?y"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/d;p?y"
Received: "http://a/b/c/d;p?q"

[Killed] ConditionalExpression
src/_uri.js:250:24
                 path = base.path;
                 query = query != null ? query : base.query;
             } else {
-                path = path.charAt(0) === '/' ? path : removeDotSegments(_merge(base, path));
+                path = true ? path : removeDotSegments(_merge(base, path));
             }
         }
killedBy: resolve test: ['g', 'http://a/b/c/d;p?q', 'http://a/b/c/g']
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://a/b/c/g"
Received: "http://ag"

[Killed] ObjectLiteral
src/_uri.js:255:12
         }
     }
     path && (path = removeDotSegments(path));
-    return { scheme, authority, userInfo, host, port, path, query, fragment };
+    return {};
 }
 
killedBy: resolve test: ["g:h", "http://a/b/c/d;p?q", "g:h"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g:h"
Received: "undefined"

[Killed] ConditionalExpression
src/_uri.js:261:9
 // 5.2.1.  Pre-parse the Base URI
 
 function _preParseBaseUri({ scheme }) {
-    if (scheme == null) {
+    if (false) {
         throw new Error('Violation 5.2.1, scheme component required');
     }
killedBy: _preParseBaseUri should throw specific error for missing scheme
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Violation 5.2.1, scheme component required"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:284:38
 * @memberof module:uri
 * @returns {array} Path split to DECODED segments as array
 */
-function decodeSegments(encodedPath) {
-    // Stryker disable next-line all // (quick exit only, no logic change)
-    if (encodedPath === '') {
-        return [];
-    }
-    const segments = encodedPath.split('/');
-    if (segments.shift() !== '') {
-        throw new Error('path-abempty expected');
-    }
-    return segments.map((segment) => decodeURIComponent(segment));
-}
+function decodeSegments(encodedPath) {}
 
 /**
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/_uri.js:290:9
         return [];
     }
     const segments = encodedPath.split('/');
-    if (segments.shift() !== '') {
+    if (segments.shift() === '') {
         throw new Error('path-abempty expected');
     }
killedBy: decodeSegments test 1 void segment expected
statusReason: Error: path-abempty expected

[Killed] StringLiteral
src/_uri.js:291:25
     }
     const segments = encodedPath.split('/');
     if (segments.shift() !== '') {
-        throw new Error('path-abempty expected');
+        throw new Error("");
     }
     return segments.map((segment) => decodeURIComponent(segment));
killedBy: decodeSegments test 4 path-abempty expected
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "path-abempty expected"
Received message:   ""

      570 |       } else {
      571 |         stryCov_9fa48("286");
    > 572 |         throw new Error(stryMutAct_9fa48("287") ? "" : (stryCov_9fa48("287"), 'path-abempty expected'));

[Killed] ConditionalExpression
src/_uri.js:304:9
 * "" is returned
 */
 function encodeSegments(segments) {
-    if (!(segments instanceof Array)) {
+    if (false) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
killedBy: encodeSegments should throw error for non-array input
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgumentException, array of segments expected"
Received message:   "segments.map is not a function"

      605 |       }
      606 |     }
    > 607 |     return stryMutAct_9fa48("300") ? `` : (stryCov_9fa48("300"), `/${segments.map(stryMutAct_9fa48("301") ? () => undefined : (stryCov_9fa48("301"), segment => percentEncode(segm

[Killed] StringLiteral
src/_uri.js:305:25
 */
 function encodeSegments(segments) {
     if (!(segments instanceof Array)) {
-        throw new Error('IllegalArgumentException, array of segments expected');
+        throw new Error("");
     }
     if (segments.length === 0) {
killedBy: encodeSegments should throw error for non-array input
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "IllegalArgumentException, array of segments expected"
Received message:   ""

      594 |       } else {
      595 |         stryCov_9fa48("293");
    > 596 |         throw new Error(stryMutAct_9fa48("294") ? "" : (stryCov_9fa48("294"), 'IllegalArgumentException, array of segments expected'));

[Killed] ConditionalExpression
src/_uri.js:307:9
     if (!(segments instanceof Array)) {
         throw new Error('IllegalArgumentException, array of segments expected');
     }
-    if (segments.length === 0) {
+    if (true) {
         return '';
     }
killedBy: strip test: ["http://www.google.sk/foo.bar", "EXTENSION", "http://www.google.sk/foo"]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://www.google.sk/foo"
Received: "http://www.google.sk"

[Killed] StringLiteral
src/_uri.js:310:88
     if (segments.length === 0) {
         return '';
     }
-    return `/${segments.map((segment) => percentEncode(segment, RFC3986_SEGMENT)).join('/')}`;
+    return `/${segments.map((segment) => percentEncode(segment, RFC3986_SEGMENT)).join("")}`;
 }
 
killedBy: basic setters test appendSegments test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", ""], "foo://username:password@my.example.com:8042/over/the
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo://username:password@my.example.com:8042/over/there/index.x.dtb/?type=animal&name=narwhal#nose"
Received: "foo://username:password@my.example.com:8042/overthereindex.x.dtb?type=animal&name=narwhal#nose"

[Killed] EqualityOperator
src/_uri.js:323:37
 */
 function isSubordinate(uriParent, uriSub, orSame) {
     // if subordinate is absolute and parent is not or parent has different authority
-    if (uriSub.authority != null && uriSub.authority !== uriParent.authority) {
+    if (uriSub.authority != null && uriSub.authority === uriParent.authority) {
         return false;
     }
killedBy: resolveAsSubordinate test: ["foo://username:password@my.example.com:8042/a/b?type=animal&name=narwhal#nose", "/a/b/c/d"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] ConditionalExpression
src/_uri.js:327:12
         return false;
     }
     const i = uriSub.path.indexOf(uriParent.path);
-    return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
+    return false;
 }
 function encodeSegment(segment) {
killedBy: resolveAsSubordinate test: ["http:/a/b", "/a/b"]
statusReason: Error: IllegalArgument, not subordinate

[Killed] LogicalOperator
src/_uri.js:327:24
         return false;
     }
     const i = uriSub.path.indexOf(uriParent.path);
-    return i === 0 && (orSame || uriSub.path.length !== uriParent.path.length);
+    return i === 0 && (orSame && uriSub.path.length !== uriParent.path.length);
 }
 function encodeSegment(segment) {
killedBy: isSubordinate test: ["/a/b/c", "/a/b/c", true, true]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/_uri.js:356:9
 function checkEncoding(raw, legalRange, doThrow /* , flags*/) {
     // TODO: flags: ILLEGAL_PERCENT_ENCODING, SUPERFLUOUS_ASCII_PERCENT_ENCODING
     // TODO: flags: PERCENT_ENCODING_SHOULD_BE_UPPERCASE, SUPERFLUOUS_NON_ASCII_PERCENT_ENCODING
-    if (!raw) {
+    if (raw) {
         return null;
     }
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] BlockStatement
src/_uri.js:361:45
     }
     const reLegal = new RegExp(`[${legalRange}]`);
     const tokens = raw.match(PCHAR_TOKENIZER);
-    for (let i = 0; i < tokens.length; i++) {
-        const t = tokens[i];
-        if (t.length > 1) {
-            try {
-                decodeURIComponent(t);
-            } catch (ex) {
-                const e = new Error(`Illegal PCHAR sequence:${t}`);
-                if (doThrow) {
-                    throw e;
-                }
-                return e;
-            }
-        } else if (!t.match(reLegal)) {
-            const e = new Error(`Illegal PCHAR sequence:${t}`);
-            if (doThrow) {
-                throw e;
-            }
-            return e;
-        }
-    }
+    for (let i = 0; i < tokens.length; i++) {}
     return null;
 }
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:363:13
     const tokens = raw.match(PCHAR_TOKENIZER);
     for (let i = 0; i < tokens.length; i++) {
         const t = tokens[i];
-        if (t.length > 1) {
+        if (false) {
             try {
                 decodeURIComponent(t);
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/%FF%FF/c"
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:%FF%FF"

Received function did not throw

[Killed] ConditionalExpression
src/_uri.js:373:20
                 }
                 return e;
             }
-        } else if (!t.match(reLegal)) {
+        } else if (true) {
             const e = new Error(`Illegal PCHAR sequence:${t}`);
             if (doThrow) {
killedBy: basic setters test setPath test: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b/c"], "foo://username:password@my.example.com:8042/a/b/c?typ
statusReason: Error: Illegal PCHAR sequence:/
