[Killed] StringLiteral
src/_uri.js:374:33
                 return e;
             }
         } else if (!t.match(reLegal)) {
-            const e = new Error(`Illegal PCHAR sequence:${t}`);
+            const e = new Error(``);
             if (doThrow) {
                 throw e;
killedBy: basic setters test CheckEncoding should throw error when we pass special characters: [["foo://username:password@my.example.com:8042/over/there/index.x.dtb?type=animal&name=narwhal#nose", "/a/b?b/c"], 
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Illegal PCHAR sequence:?"
Received message:   ""

      734 |           } else {
      735 |             stryCov_9fa48("351");
    > 736 |             const e = new Error(stryMutAct_9fa48("352") ? `` : (stryCov_9fa48("352"), `Illegal PCHAR sequence:${t}`));

[Killed] BlockStatement
src/_uri.js:408:37
 * @memberof module:uri
 * @returns {any}
 */
-function parseQuery(query, bDecode) {
-    // returns:	Object
-    if (query == null) { return null; }
-    // Stryker disable next-line all // (quick exit only, no logic change)
-    if (query === '') { return {}; }
-
-    return query.split('&').reduce((obj, part) => {
-        const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
-        const currVal = obj[name];
-        return {
-            ...obj,
-            [name]: currVal == null ? val : (Array.isArray(currVal) ? (currVal.push(val), currVal) : [ currVal, val ])
-        };
-    }, {});
-}
+function parseQuery(query, bDecode) {}
 
 module.exports = {
killedBy: parseQuery test empty string expected using true 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[Killed] ConditionalExpression
src/_uri.js:410:9
 */
 function parseQuery(query, bDecode) {
     // returns:	Object
-    if (query == null) { return null; }
+    if (true) { return null; }
     // Stryker disable next-line all // (quick exit only, no logic change)
     if (query === '') { return {}; }
killedBy: parseQuery test empty string expected using true 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: null

[Killed] StringLiteral
src/_uri.js:414:24
     // Stryker disable next-line all // (quick exit only, no logic change)
     if (query === '') { return {}; }
 
-    return query.split('&').reduce((obj, part) => {
+    return query.split("").reduce((obj, part) => {
         const [ name, val ] = part.split('=').map(bDecode ? decodeURIComponent : (p) => p);
         const currVal = obj[name];
killedBy: parseQuery test string query expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  5
+ Received  + 13

  Object {
-   "x": Array [
-     "10",
